{
  "patternsArray": [
    {
      "patternSteps": {
        "0": " Number of Moves: 19\n",
        "1": " Ready Posture:\n",
        "2": " Step 1. Move the left foot to B forming a left walking stance toward B while executing a low block to B with the left forearm.\n",
        "3": " Step 2. Move the right foot to B forming a right walking stance toward B while executing a middle punch to B with the right fist.\n",
        "4": " Step 3. Move the right foot to A, turning clockwise to form a right walking stance toward A while executing a low block to A with the right forearm.\n",
        "5": " Step 4. Move the left foot to A forming a left walking stance toward A while executing a middle punch to A with the left fist.\n",
        "6": " Step 5. Move the left foot to D forming a left walking stance toward D while executing a low block to D with the left forearm.\n",
        "7": " Step 6. Move the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "8": " Step 7. Move the right foot to C turning clockwise to form a right walking stance toward C while executing a low block to C with the right forearm.\n",
        "9": " Step 8. Move the left foot to C forming a left walking stance toward C while executing a middle punch to C with the left fist.\n",
        "10": " Step 9. Move the left foot to A forming a right L-stance toward A while executing a middle block to A with the left inner forearm.\n",
        "11": " Step 10. Move the right foot to A forming a right walking stance toward A while executing a middle punch to A with the right fist.\n",
        "12": " Step 11. Move the right foot to B turning clockwise to form a left L-stance toward B while executing a middle block to B with the right inner forearm.\n",
        "13": " Step 12. Move the left foot to B forming a left walking stance toward B while executing a middle punch to B with the left fist\n",
        "14": " Step 13. Move the left foot to C forming a right L-stance toward C while executing a middle block to C with the left inner forearm.\n",
        "15": " Step 14. Move the right foot to C forming a right walking stance toward C while executing a middle punch to C with the right fist.\n",
        "16": " Step 15. Move the right foot to D turning clockwise to form a left L-stance toward D while executing a middle block to D with the right inner forearm.\n",
        "17": " Step 16. Move the left foot to D forming a left walking stance toward D while executing a middle punch to D with the left fist.\n",
        "18": " Step 17. Move the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "19": " Step 18. Move the right foot to C forming a left walking stance toward D while executing a middle punch to D with the left fist.\n",
        "20": " Step 19. Move the left foot to C forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "21": " End: Bring the foot back to a ready position.\n"
      },
      "title": "Chon-Ji"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 21\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Move the left foot to B forming a right L-stance toward B, at the same time executing a middle guarding block to B with a knife-hand.\n",
        "3": " Step 2. Move the right foot to B forming a right walking stance toward B while executing a high punch to B with the right fist.\n",
        "4": " Step 3. Move the right foot to A turning clockwise to form a left L-stance toward A, at the same time executing a middle guarding block to A with a knife-hand.\n",
        "5": " Step 4. Move the left foot to A forming a left walking stance toward A while executing a high punch to A with the left fist.\n",
        "6": " Step 5. Move the left foot to D forming a left walking stance toward D while executing a low block to D with the left forearm.\n",
        "7": " Step 6. Move the right foot to D forming a right walking stance toward D while executing a high punch to D with the right fist.\n",
        "8": " Step 7. Move the left foot to D forming a left walking stance toward D while executing a high punch to D with the left fist.\n",
        "9": " Step 8. Move the right foot to D forming a right walking stance toward D while executing a high punch to D with the right fist..\n",
        "10": " Step 9. Move the left foot to E, turning counter clockwise to form a right L-stance toward E while executing a twin forearm block to E.\n",
        "11": " Step 10. Move the right foot to E forming a right walking stance toward E while executing a high punch to E with the right fist.\n",
        "12": " Step 11. Move the right foot to F turning clockwise to form a left L-stance toward F while executing a twin forearm block to F.\n",
        "13": " Step 12. Move the left foot to F forming a left walking stance toward F while executing a high punch to F with the left fist.\n",
        "14": " Step 13. Move the left foot to C forming a left walking stance toward C while executing a low block to C with the left forearm.\n",
        "15": " Step 14. Execute a rising block with the left forearm, maintaining the left walking stance toward C. Perform 13 and 14 in a continuous motion.\n",
        "16": " Step 15. Move the right foot to C forming a right walking stance toward C, at the same time executing a rising block with the right forearm.\n",
        "17": " Step 16. Move the left foot to C forming a left walking stance toward C, at the same time executing a rising block with the left forearm.\n",
        "18": " Step 17. Move the right foot to C forming a right walking stance toward C, at the same time executing a rising block with the right forearm.\n",
        "19": " Step 18. Move the left foot to B turning counter clockwise to form a right L-stance toward B while executing a middle outward strike to B with the left knife-hand.\n",
        "20": " Step 19. Move the right foot to B forming a right walking stance toward B while executing a high punch to B with the right fist.\n",
        "21": " Step 20. Move the right foot to A turning clockwise to form a left L-stance toward A while executing a middle outward strike to A with the right knife-hand.\n",
        "22": " Step 21. Move the left foot to A forming a left walking stance toward A while executing a high punch to A with the left fist.\n",
        "23": " End: Bring the foot back to a ready position.\n"
      },
      "title": "Dan-Gun"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 24\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Move the left foot to B, forming a left walking stance toward B while executing a high side block to B with the left outer forearm.\n",
        "3": " Step 2. Execute a middle punch to B with the right fist while maintaining a left walking stance toward B.\n",
        "4": " Step 3. Move the left foot on line AB, and then turn clockwise to form a right walking stance toward A while executing a high side block to A with the right outer forearm.\n",
        "5": " Step 4. Execute a middle punch to A with the left fist while maintaining a right walking stance toward A.\n",
        "6": " Step 5. Move the left foot to D, forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "7": " Step 6. Move the right foot to D forming a right walking stance toward D while executing a middle thrust to D with the right straight fingertip.\n",
        "8": " Step 7. Twist the right knife-hand together with the body counter clockwise until its palm faces downward and then move the left foot to D, turning counter clockwise to form a left walking stance toward D while executing a high side strike to D with the left back fist.\n",
        "9": " Step 8. Move the right foot to D forming a right walking stance toward D while executing a high side strike to D with the right back fist.\n",
        "10": " Step 9. Move the left foot to E, turning counter clockwise to form a left walking stance toward E while executing a high side block to E with the left outer forearm.\n",
        "11": " Step 10. Execute a middle punch to E with the right fist while maintaining a left walking stance toward E.\n",
        "12": " Step 11. Move the left foot on line EF, and then turn clockwise to form a right walking stance toward F while executing a high side block to F with the right outer forearm.\n",
        "13": " Step 12. Execute a middle punch to F with the left fist while maintaining a right walking stance toward F.\n",
        "14": " Step 13. Move the left foot to CE forming a left walking stance toward CE, at the same time executing a high wedging block to CE with the outer forearm.\n",
        "15": " Step 14. Execute a middle front snap kick to CE with the right foot, keeping the position of the hands as they were in 13.\n",
        "16": " Step 15. Lower the right foot to CE forming a right walking stance toward CE while executing a middle punch to CE with the right fist.\n",
        "17": " Step 16. Execute a middle punch to CE with the left fist while maintaining a right walking stance toward CE. Perform 15 and 16 in a fast motion.\n",
        "18": " Step 17. Move the right foot to CF forming a right walking stance toward CF while executing a high wedging block to CF with the outer forearm.\n",
        "19": " Step 18. Execute a middle front snap kick to CF with the left foot, keeping the position of the hands as they were in 17.\n",
        "20": " Step 19. Lower the left foot to CF forming a left walking stance toward CF while executing a middle punch to CF with the left fist.\n",
        "21": " Step 20. Execute a middle punch to CF with the right fist while maintaining a left walking stance toward CF. Perform 19 and 20 in a fast motion.\n",
        "22": " Step 21. Move the left foot to C forming a left walking stance toward C, at the same time executing a rising block with the left forearm.\n",
        "23": " Step 22. Move the right foot to C forming a right walking stance toward C while executing a rising block with the right forearm.\n",
        "24": " Step 23. Move the left foot to B, turning counter clockwise to form a sitting stance toward D while executing a middle side strike to B with the left knife-hand.\n",
        "25": " Step 24. Bring the left foot to the right foot and then move the right foot to A forming a sitting stance toward D while executing a middle side strike to A with the right knife-hand.\n",
        "26": " End: Bring the foot back to a ready position\n"
      },
      "title": "Do-San"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 28\n",
        "1": " Ready Posture: Closed Ready Stance A\n",
        "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a twin forearm block.\n",
        "3": " Step 2. Execute a high inward strike to B with the right knife-hand while bringing the left side fist in front of the right shoulder, maintaining a right L-stance toward B.\n",
        "4": " Step 3. Execute a middle punch to B with the left fist while forming a left fixed stance toward B, slipping the left foot to B.\n",
        "5": " Step 4. Bring the left foot to the right footand then move the right foot to A, forming a left L-stance toward A while executing a twin forearm block.\n",
        "6": " Step 5. Execute a high inward strike to A with the left knife-hand while bringing the right side fist in front of the left shoulder, maintaining a left L-stance toward A.\n",
        "7": " Step 6. Execute a middle punch to A with the right fist while forming a right fixed stance toward A, slipping the right foot to A.\n",
        "8": " Step 7. Bring the right foot to the left foot and then turn the face toward D while forming a right bending ready stance A toward D.\n",
        "9": " Step 8. Execute a middle side piercing kick to D with the left foot.\n",
        "10": " Step 9. Lower the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "11": " Step 10. Move the right foot to D forming a left L-stance toward D while executing a guarding block to D with a knife-hand.\n",
        "12": " Step 11. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "13": " Step 12. Move the right foot to D forming a right walking stance toward D while executing a middle thrust to D with the right straight finger tip.\n",
        "14": " Step 13. Move the left foot to E turning counter clockwise to form a right L-stance toward E, at the same time executing a twin forearm block.\n",
        "15": " Step 14. Execute a high inward strike to E with the right knife-hand while bringing the left side fist in front of the right shoulder, maintaining a right L-stance toward E.\n",
        "16": " Step 15. Execute a middle punch to E with the left fist while forming a left fixed stance toward E, slipping the left foot to E.\n",
        "17": " Step 16. Bring the left foot to the right foot and then move the right foot to F, forming a left L-stance toward F while executing a twin forearm block.\n",
        "18": " Step 17. Execute a high inward strike to F with the left knife-hand while bringing the right side fist in front of the left shoulder, maintaining a left L-stance toward F.\n",
        "19": " Step 18. Execute a middle punch to F with the right fist while forming a right fixed stance toward F, slipping the right foot to F.\n",
        "20": " Step 19. Bring the right foot to the left foot and then move the left foot to C forming a left walkng stance toward C while executing a circular block to CF with the right inner forearm.\n",
        "21": " Step 20. Execute a low front snap kick to C with the right foot, keeping the position of the hands as they were in 19.\n",
        "22": " Step 21. Lower the right foot to C forming a right walking stance toward C while executing a middle punch to C with the left fist.\n",
        "23": " Step 22. Execute a circular block to CE with the left inner forearm while maintaining a right walking stance toward C.\n",
        "24": " Step 23. Execute a low front snap kick to C with the left foot, keeping the position of the hands as they were in 22.\n",
        "25": " Step 24. Lower the left foot to C forming a left walking stance toward C while executing a middle punch to C with the right fist.\n",
        "26": " Step 25. Turn the face toward C forming a left bending ready stance A toward C.\n",
        "27": " Step 26. Execute a middle side piercing kick to C with the right foot.\n",
        "28": " Step 27. Lower the right foot on line CD and then move the left foot to B, turning counter clockwise to form a right L-stance toward B, at the same time executing a middle guarding block to B with the forearm.\n",
        "29": " Step 28. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A while executing a middle guarding clock to A with the forearm.\n",
        "30": " End: Bring the foot back to a ready position.\n"
      },
      "title": "Won-Hyo"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 38\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Move the left foot to B forming a sitting stance toward D while extending the left fist to D horizontally.\n",
        "3": " Step 2. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
        "4": " Step 3. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D. Perform 2 and 3 in a fast motion.\n",
        "5": " Step 4. Bring the left foot to the right foot and then move the right foot to A forming a sitting stance toward D while extending the right fist to D horizontally.\n",
        "6": " Step 5. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D.\n",
        "7": " Step 6. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D. Perform 5 and 6 in a fast motion.\n",
        "8": " Step 7. Move the right foot to AD forming a right walking stance toward AD while executing a middle side block to AD with the right inner forearm.\n",
        "9": " Step 8. Execute a low front snap kick to AD with the left foot keeping the position of the hands as they were in 7.\n",
        "10": " Step 9. Lower the left foot to AD forming a left walking stance toward AD while executing a middle punch to AD with the left fist.\n",
        "11": " Step 10. Execute a middle punch to AD with the right fist while maintaining a left walking stance toward AD. Perform 9 and 10 in a fast motion.\n",
        "12": " Step 11. Move the left foot to BD forming a left walking stance toward BD at the same time executing a middle side block to BD with the left inner forearm.\n",
        "13": " Step 12. Execute a low front snap kick to BD with the right foot keeping the position of the hands as they were in 11.\n",
        "14": " Step 13. Lower the right foot to BD forming a right walking stance toward BD while executing a middle punch to BD with the right fist.\n",
        "15": " Step 14. Execute a middle punch to BD with the left fist while maintaining a right walking stance toward BD. Perform 13 and 14 in a fast motion.\n",
        "16": " Step 15. Execute a middle hooking block to D with the right palm while forming a right walking stance toward D, pivoting with the left foot.\n",
        "17": " Step 16. Execute a middle hooking block to D with the left palm while maintaining a right walking stance toward D.\n",
        "18": " Step 17. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D. Execute 16 and 17 in a connecting motion.\n",
        "19": " Step 18. Move the left foot to D forming a left walking stance toward D while executing a middle hooking block to D with the left palm.\n",
        "20": " Step 19. Execute a middle hooking block to D with the right palm while maintaining a left walking stance toward D.\n",
        "21": " Step 20. Execute a middle punch to D with the left fist while maintaining a left walking stance toward D. Execute 19 and 20 in a connecting motion.\n",
        "22": " Step 21. Move the right foot to D forming a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
        "23": " Step 22. Turn the face toward D forming a right bending ready stance A toward D.\n",
        "24": " Step 23. Execute a middle side piercing kick to D with the left foot.\n",
        "25": " Step 24. Lower the left foot to D forming a left walking stance toward D while striking the left palm with the right front elbow.\n",
        "26": " Step 25. Turn the face toward C forming a left bending ready stance A toward C.\n",
        "27": " Step 26. Execute a middle side piercing kick to C with the right foot.\n",
        "28": " Step 27. Lower the right foot to C forming a right walking stance toward C while striking the right palm with the left front elbow.\n",
        "29": " Step 28. Move the left foot to E forming a right L-stance toward E while executing a twin knife-hand block.\n",
        "30": " Step 29. Move the right foot to E forming a right walking stance toward E while executing a middle thrust to E with the right straight finger tip.\n",
        "31": " Step 30. Move the right foot to F turning clockwise to form a left L-stance toward F while executing a twin knife-hand block.\n",
        "32": " Step 31. Move the left foot to F forming a left walking stance toward F while executing a middle thrust to F with the left straight finger tip.\n",
        "33": " Step 32. Move the left foot to C forming a left walking stance toward C while executing a high side block to C with the left outer forearm.\n",
        "34": " Step 33. Execute a middle punch to C with the right fist while maintaining a left walking stance toward C.\n",
        "35": " Step 34. Move the right foot to C forming a right walking stance toward C while executing a high side block to C with the right outer forearm.\n",
        "36": " Step 35. Execute a middle punch to C with the left fist while maintaining a right walking stance toward C.\n",
        "37": " Step 36. Jump to C forming a left X-stance toward B while executing a high side strike to C with the left back fist.\n",
        "38": " Step 37. Move the right foot to A forming a right walking stance toward A at the same time executing a high block to A with the right double forearm.\n",
        "39": " Step 38. Bring the right foot to the left foot and then move the left foot to B forming a left walking stance toward B while executing a high block to B with the left double forearm.\n",
        "40": " End: Bring the foot back to a ready position\n"
      },
      "title": "Yul-Gok"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 32\n",
        "1": " Ready Posture: Closed Ready Stance B\n",
        "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a middle block to B with the left reverse knife-hand.\n",
        "3": " Step 2. Execute a low side front snap kick to B with the left foot, keeping the position of the hands as they were in 1.\n",
        "4": " Step 3. Lower the left foot to B and then move the right foot to B forming a left rear foot stance toward B while executing an upward block with a right palm.\n",
        "5": " Step 4. Move the right foot to A forming a left L-stance toward A, at the same time executing a middle block to A with a right reverse knife-hand.\n",
        "6": " Step 5. Execute a low side front snap kick to A with the right foot, keeping the position of the hands as they were in 4.\n",
        "7": " Step 6. Lower the right foot to A and then move the left foot to A forming a right rear foot stance toward A while executing an upward block with a left palm.\n",
        "8": " Step 7. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "9": " Step 8. Execute a right upper elbow strike while forming a left walking stance toward D, slipping the left foot to D.\n",
        "10": " Step 9. Move the right foot to D forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "11": " Step 10. Execute a left upper elbow strike while forming a right walking stance toward D, slipping the right foot to D.\n",
        "12": " Step 11. Move the left foot to D forming a left walking stance toward D while executing a high vertical punch to D with a twin fist.\n",
        "13": " Step 12. Move the right foot to D forming a right walking stance toward D while executing an upset punch to D with a twin fist.\n",
        "14": " Step 13. Move the right foot on line CD and then turn counter clockwise to form a left walking stance toward C while executing a rising block with an X-fist.\n",
        "15": " Step 14. Move the left foot to E forming a right L-stance toward E while executing a high side strike to E with the left back fist.\n",
        "16": " Step 15. Twist the left fist counter clockwise until the back fist faces downward, at the same time forming a left walking stance toward E, slipping the left foot to E.\n",
        "17": " Step 16. Execute a high punch to E with the right fist while maintaining a left walking stance toward E. Perform 15 and 16 in a fast motion.\n",
        "18": " Step 17. Bring the left foot to the right foot and then move the right foot to F, forming a left L-stance toward F while executing a high side strike to F with a right back fist.\n",
        "19": " Step 18. Twist the right fist clockwise until the back fist faces downward, at the same time forming a right walking stance toward F, slipping the right foot to F.\n",
        "20": " Step 19. Execute a high punch to F with the left fist while maintaining a right walking stance toward F. Perform 18 and 19 in a fast motion.\n",
        "21": " Step 20. Bring the right foot to the left foot and then move the left foot to C forming a left walking stance toward C while executing a high block to C with a left double forearm.\n",
        "22": " Step 21. Execute a middle punch to C with the left fist while forming a right L-stance toward C, pulling the left foot.\n",
        "23": " Step 22. Execute a middle side piercing kick to C with the right foot.\n",
        "24": " Step 23. Lower the right foot to C forming a right walking stance toward C while executing a high block to C with the right double forearm.\n",
        "25": " Step 24. Execute a middle punch to C with the right fist while forming a left L-stance toward C, pulling the right foot.\n",
        "26": " Step 25. Execute a middle side piercing kick to C with the left foot.\n",
        "27": " Step 26. Lower the left foot to C forming a right L-stance toward C while executing amiddle guarding block to C with the forearm.\n",
        "28": " Step 27. Execute a pressing block with the right palm while forming a left low stance toward C, slipping the left foot to C. Perform in slow motion..\n",
        "29": " Step 28. Move the right foot to C forming a left L-stance toward C while executing a middle guarding block to C with the forearm.\n",
        "30": " Step 29. Execute a pressing block with the left palm while forming a right low stance toward C, slipping the right foot to C. Perform in a slow motion.\n",
        "31": " Step 30. Bring the left foot to the right foot forming a closed stance toward A while executing an angle punch with the right fist. Perform in slow motion.\n",
        "32": " Step 31. Move the right foot to A forming a right fixed stance toward A while executing a U-shape block to A.\n",
        "33": " Step 32. Bring the right foot to the left foot and then move the left foot to B forming a left fixed stance toward B, at the same time executing a U-shape block to B.\n",
        "34": " End: Bring the foot back to a ready position.\n"
      },
      "title": "Joong-Gun"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 37\n",
        "1": " Ready Posture: Closed Ready Stance B\n",
        "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a middle block to B with the left inner forearm.\n",
        "3": " Step 2. Execute a low thrust to B with the right upset finger tip while forming a left walking stance toward B, slipping the left foot to B.\n",
        "4": " Step 3. Bring the left foot to the right foot to form a closed stance toward D while executing a side back strike to C with the right back fist, extending the left arm to the side downward. Perform in slow motion.\n",
        "5": " Step 4. Move the right foot to A forming a left L-stance toward A while executing a middle block to A with the right inner forearm.\n",
        "6": " Step 5. Execute a low thrust to A with the left upset finger tip while forming a right walking stance toward A, slipping the right foot to A.\n",
        "7": " Step 6. Bring the right foot to the left foot to form a closed stance toward D while executing a side back strike to C with the left back fist, extending the right arm to the side downward. Perform in slow motion.\n",
        "8": " Step 7. Move the left foot to D forming a left walking stance toward D while executing a pressing block with an X-fist.\n",
        "9": " Step 8. Execute a high vertical punch to D with a twin fist while maintaining a left walking stance toward D. Perform 7 and 8 in a continuous motion.\n",
        "10": " Step 9. Execute a middle front snap kick to D with the right foot, keeping the position of the hands as they were in 8.\n",
        "11": " Step 10. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "12": " Step 11. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D.\n",
        "13": " Step 12. Bring the left foot to the right foot forming a closed stance toward F while executing a twin side elbow thrust. Perform in slow motion.\n",
        "14": " Step 13. Move the right foot to F in a stamping motion forming a sitting stance toward C while executing a W-shape block to C with the right outer forearm.\n",
        "15": " Step 14. Move the left foot to F in a stamping motion turning clockwise to form a sitting stance toward D while executing a W-shape block to D with the left outer forearm.\n",
        "16": " Step 15. Move the left foot to E in a stamping motion turning clockwise to form a sitting stance toward C while executing a W-shape block to C with the left outer forearm.\n",
        "17": " Step 16. Move the right foot to E in a stamping motion turning counter clockwise to form a sitting stance toward D while executing a W-shape block to D with the right outer forearm.\n",
        "18": " Step 17. Move the left foot to E in a stamping motion turning clockwise to form a sitting stance toward C while executing a W-shape block to C with the left outer forearm.\n",
        "19": " Step 18. Move the left foot to F in a stamping motion turning clockwise to form a sitting stance toward D while executing a W-shape block to D with the left outer forearm.\n",
        "20": " Step 19. Bring the right foot to the left foot and then move the left foot to D forming a right L-stance toward D while executing a low pushing block to D with the left double forearm.\n",
        "21": " Step 20. Extend both hands upward as if to grab the opponent's head while forming a left walking stance toward D, slipping the left foot to D.\n",
        "22": " Step 21. Execute an upward kick with the right knee while pulling both hands downward.\n",
        "23": " Step 22. Lower the right foot to the left foot and then move the left foot to C forming a right L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "24": " Step 23. Execute a low side front snap kick to C with the left foot, keeping the position of the hands as they were in 22.\n",
        "25": " Step 24. Lower the left foot to C forming a left walking stance toward C while executing a high thrust to C with the left flat finger tip\n",
        "26": " Step 25. Move the right foot to C forming a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "27": " Step 26. Execute a low side front snap kick to C with the right foot, keeping the position of the hands as they were in 25.\n",
        "28": " Step 27. Lower the right foot to C forming a right walking stance toward C while executing a high thrust to C with the right flat finger tip.\n",
        "29": " Step 28. Move the right foot to D forming a right L-stance toward C while executing a side back strike to D with the right back fist and a low block to C with the left forearm.\n",
        "30": " Step 29. Jump to C forming a right X-stance toward A while executing a pressing block with an X-fist.\n",
        "31": " Step 30. Move the right foot to C forming a right walking stance toward C while executing a high block to C with the right double forearm.\n",
        "32": " Step 31. Move the left foot to B forming a right L-stance toward B while executing a low guarding block to B with a knife-hand.\n",
        "33": " Step 32. Execute a circular block to BD with the right inner forearm while forming a left walking stance toward B, slipping the left foot to B.\n",
        "34": " Step 33. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A, at the same time executing a low guarding block to A with a knife-hand.\n",
        "35": " Step 34. Execute a circular block to AD with the left inner forearm while forming a right walking stance toward A, slipping the right foot to A.\n",
        "36": " Step 35. Execute a circular block to CE with the right inner forearm while forming a left walking stance toward CE.\n",
        "37": " Step 36. Execute a circular block to AD with the left inner forearm while forming a right walking stance toward A.\n",
        "38": " Step 37. Move the right foot on line AB to form a sitting stance toward D while executing a middle punch to D with the right fist.\n",
        "39": " End: Bring the foot back to a ready position\n"
      },
      "title": "Toi-Gye"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 29\n",
        "1": " Ready Posture: Closed Ready Stance C\n",
        "2": " Step 1. Move the left foot to B to forma sitting stance toward D while executing a middle pushing block to D with the left palm.\n",
        "3": " Step 2. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
        "4": " Step 3. Execute a middle punch to D with the left fist while maintaining a sitting stance toward D.\n",
        "5": " Step 4. Execute a twin forearm block while forming a left L-stance toward A, pivoting with the let foot.\n",
        "6": " Step 5. Execute an upward punch with the left fist while pulling the right side fist in front of the left shoulder, maintaining a left L-stance toward A.\n",
        "7": " Step 6. Execute a middle punch to A with the right fist while forming a right fixed stance toward A in a sliding motion.\n",
        "8": " Step 7. Execute a downward strike with the right knife-hand while forming a left vertical stance toward A, pulling the right foot.\n",
        "9": " Step 8. Move the left foot to A forming a left walking stance toward A while executing a middle punch to A with the left fist.\n",
        "10": " Step 9. Move the left foot to D forming a left walking stance toward D while executing a low block to D with the left forearm.\n",
        "11": " Step 10. Move the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "12": " Step 11. Pull the left foot toward the right foot while bringing the left palm to the right forefist, at the same time bending the right elbow about 45 degrees outward.\n",
        "13": " Step 12. Execute a middle side piercing kick to D with the right foot while pulling both hands in the opposite direction and then lower it to D forming a left L-stance toward D, at the same time executing a middle outward strike to D with the right knife-hand.\n",
        "14": " Step 13. Move the left foot to D forming a left walking stance toward D while executing a middle punch to D with the left fist.\n",
        "15": " Step 14. Move the right foot to D forming a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
        "16": " Step 15. Move the left foot to E turning counter clockwise to form a right L-stance toward E while executing a middle guarding block to E with a knife-hand.\n",
        "17": " Step 16. Move the right foot to E forming a right walking stance toward E while executing a middle thrust to E with the right straight finger tip.\n",
        "18": " Step 17. Move the right foot on line EF forming a right L-stance toward F while executing a middle guarding block to F with a knife-hand.\n",
        "19": " Step 18. Execute a high turning kick to DF with the right foot and then lower it to F.\n",
        "20": " Step 19. Execute a high turning kick to CF with the left foot and then lower it to F forming a right L-stance toward F while executing a middle guarding block to F with a knife-hand. Perform 18 and 19 in a fast motion..\n",
        "21": " Step 20. Move the left foot to C forming a left walking stance toward C while executing a low block to C with the left forearm.\n",
        "22": " Step 21. Execute a middle punch to C with the right fist while forming a right L-stance toward C, pulling the left foot.\n",
        "23": " Step 22. Move the right foot to C forming a left L-stance toward C while executing a middle punch to C with the left fist.\n",
        "24": " Step 23. Move the left foot to C forming a right L-stance toward C while executing a middle punch to C with the right fist.\n",
        "25": " Step 24. Execute a pressing block with an X-fist while forming a left walking stance toward C, slipping the left foot to C.\n",
        "26": " Step 25. Move the right foot to C in a sliding motion forming a right L-stance toward D while thrusting to C with the right side elbow.\n",
        "27": " Step 26. Bring the left foot to the right foot, turning counter clockwise to form a closed stance toward B while executing a side front block with the right inner forearm while extending the left forearm to the side downward.\n",
        "28": " Step 27. Execute a side front block with the left inner forearm, extending the right forearm to the side downward while maintaining a closed stance toward B..\n",
        "29": " Step 28. Move the left foot to B forming a right L-stance toward B at the same time executing a middle guarding block to B with a knife-hand.\n",
        "30": " Step 29. Bring the left foot to the right foot and then move the right foot to A forming a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
        "31": " End: Bring the foot back to a ready position\n"
      },
      "title": "Hwa-Rang"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 30\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Move the left foot to B forming a right L-stance toward B while executing a twin knife-hand block.\n",
        "3": " Step 2. Move the right foot to B forming a right walking stance toward B while executing a high front strike to B with the right knife-hand and bring the left back hand in front of the forehead.\n",
        "4": " Step 3. Move the right foot to A turning clockwise to form a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
        "5": " Step 4. Move the left foot to A forming a left walking stance toward A while executing a high thrust to A with the left flat finger tip.\n",
        "6": " Step 5. Move the left foot to D forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "7": " Step 6. Turn the face to C forming a left bending ready stance A toward C.\n",
        "8": " Step 7. Execute a middle side piercing kick to C with the right foot.\n",
        "9": " Step 8. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "10": " Step 9. Execute a flying side piercing kick to D with the right foot soon after moving it to D and then land to D forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "11": " Step 10. Move the left foot to E turning counter clockwise to form a right L-stance toward E at the same time executing a low block to E with the left forearm.\n",
        "12": " Step 11. Extend both hands upward as if to grab the opponent's head while forming a left walking stance toward E, slipping the left foot.\n",
        "13": " Step 12. Execute an upward kick to E with the right knee pulling both hands downward.\n",
        "14": " Step 13. Lower the right foot to the left foot and then move the left foot to F forming a left walking stance toward F while executing a high front strike to F with the right reverse knife-hand, bringing the left back hand under the right elbow joint.\n",
        "15": " Step 14. Execute a high turning kick to DF with the right foot and then lower it to the left foot.\n",
        "16": " Step 15. Execute a middle back piercing kick to F with the left foot. Perform 14 and 15 in a fast motion.\n",
        "17": " Step 16. Lower the left foot to F forming a left L-stance toward E while executing a middle guarding block to E with the forearm.\n",
        "18": " Step 17. Execute a middle turning kick to DE with the left foot.\n",
        "19": " Step 18. Lower the left foot to the right foot and then move the right foot to C forming a right fixed stance toward C while executing a U-shape block toward C.\n",
        "20": " Step 19. Jump and spin around counter clockwise, landing on the same spot to form a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "21": " Step 20. Move the left foot to C forming a left walking stance toward C at the same time executing a low thrust to C with the right upset fingertip.\n",
        "22": " Step 21. Execute a side back strike to D with the right back fist and a low block to C with the left forearm while forming a right L-stance toward C, pulling the left foot.\n",
        "23": " Step 22. Move the right foot to C forming a right walking stance toward C while executing a middle thrust to C with the right straight finger tip.\n",
        "24": " Step 23. Move the left foot to B turning counter clockwise to form a left walking stance toward B while executing a high block to B with the left double forearm.\n",
        "25": " Step 24. Move the right foot to B forming a sitting stance toward C while executing a middle front block to C with the right forearm and then a high side strike to B with the right back fist.\n",
        "26": " Step 25. Execute a middle side piercing kick to A with the right foot turning counter clockwise and then lower it to A.\n",
        "27": " Step 26. Execute a middle side piercing kick to A with the left foot turning clockwise.\n",
        "28": " Step 27. Lower the left foot to A and then execute a checking block to B with an X-knife-hand while forming a left L-stance toward B pivoting with the left foot.\n",
        "29": " Step 28. Move the left foot to B forming a left walking stance toward B while executing an upward block to B with a twin palm.\n",
        "30": " Step 29. Move the left foot on line AB and then execute a rising block with the right forearm while forming a right walking stance toward A.\n",
        "31": " Step 30. Execute a middle punch to A with the left fist while maintaining a right walking stance toward A.\n",
        "32": " End: Bring the foot back to a ready position\n"
      },
      "title": "Choong-Moo"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 39\n",
        "1": " Ready Posture: Parallel Stance with a Heaven Hand\n",
        "2": " Step 1. Bring the left foot to the right foot, forming a close ready stance B toward D, bringing both hands in a circular motion.\n",
        "3": " Step 2. Move the left foot to D, forming a left walking stance toward D while executing an upset punch to D with the right fist. Perform in slow motion.\n",
        "4": " Step 3. Move the right foot to D, forming a right walking stance toward D while executing an upset punch to D with the left fist. Perform in slow motion.\n",
        "5": " Step 4. Move the left foot to the side front of the right foot, and then move the right foot to D, forming a right walking stance toward D, at the same time executing a high hooking block to D with the right palm. Perform in a double steppng motion.\n",
        "6": " Step 5. Move the right foot to C in a sliding motion to form a right L-stance toward D, at the same time executing a low guarding block to D with a knife-hand.\n",
        "7": " Step 6. Move the right foot to the side front of the left foot and then move the left foot to D, forming a left walking stance toward D while executing a high hooking block to D with the left palm. Perform in a double stepping motion.\n",
        "8": " Step 7. Move the left foot to C in a sliding motion forming a left L-stance toward D while executing a low guarding block to D with a knife-hand.\n",
        "9": " Step 8. Move the left foot to D, forming a right rear foot stance toward D while executing a high guarding block to D with a knife-hand.\n",
        "10": " Step 9. Move the right foot to D, forming a left rear foot stance toward D while executing a high guarding block to D with a knife-hand.\n",
        "11": " Step 10. Move the left foot to the side front of the right foot and then turn counter-clockwise, pivoting with the left foot, to form a left walking stance toward C while executing an upward block to C with the right palm. Perform in a slow motion.\n",
        "12": " Step 11. Move the right foot to C, forming a right walking stance toward C while executing an upward block to C with the left palm. Perform in a slow motion.\n",
        "13": " Step 12. Execute a low front block with the right knife-hand in a circular motion, hitting the left palm while bringing the left foot to the right foot to form a close stance toward C.\n",
        "14": " Step 13. Execute a pressing kick to E with the left foot, keeping the position of the hands as they were in 12.\n",
        "15": " Step 14. Execute a middle side piercing kick to E with the left foot, keeping the position of the hands as they were in 13. Perform 13 and 14 in a consecutive kick.\n",
        "16": " Step 15. Lower the left foot to E, forming a right L-stance toward E while executing a high inward strike to E with the right knife-hand and bringing the left side fist in front of the right shoulder.\n",
        "17": " Step 16. Execute a downward strike to E with the left side fist while forming a close stance toward C, pulling the left foot to the right foot.\n",
        "18": " Step 17. Execute a pressing kick to F with the right foot, keeping the position of the hands as they were in 16.\n",
        "19": " Step 18. Execute a middle side piercing kick to F with the right foot, keeping the position of the hands as they were in 17. Perform 17 and 18 in a consecutive kick.\n",
        "20": " Step 19. Lower the right foot to F, forming a left L-stance toward F while executing a high inward strike to F with the knife-hand and bringing the right side fist in front of the left shoulder.\n",
        "21": " Step 20. Execute a downward strike to F with the right side fist while forming a close stance toward C, pulling the right foot to the left foot.\n",
        "22": " Step 21. Move the left foot to C, forming a left low stance toward C while executing a pressing block with the right palm. Perform in slow motion.\n",
        "23": " Step 22. Move the right foot to C, forming a right low stance toward C while executing a pressing block with the left palm. Perform in a slow motion.\n",
        "24": " Step 23. Move the right foot to D in a stamping motion to form a sitting stance toward F while executing a high side strike to D with the right back fist.\n",
        "25": " Step 24. Execute a middle block to D with the right double forearm while forming a right walking stance toward D, pivoting with the left foot.\n",
        "26": " Step 25. Execute a low block to D with the left forearm while shifting to C, maintaining a right walking stance toward D, keeping the position of the right hand as it was in 24.\n",
        "27": " Step 26. Execute a high thrust to D with the right flat fingertip while forming a right low stance toward D, slipping the right foot to D. Perform in slow motion.\n",
        "28": " Step 27. Move the left foot on lone CD in a stamping motion to form a sitting stance toward F while executing a high side strike to C with the left back fist.\n",
        "29": " Step 28. Execute a middle block to C with the left double forearm while forming a left walking stance toward C, pivoting with the left foot.\n",
        "30": " Step 29. Execute a low reverse block to C with the right forearm while shifting to D, maintaining a left walking stance toward C, keeping the position of the left hand as it was in 28.\n",
        "31": " Step 30. Execute a high thrust to C with the left flat fingertip while forming a left low stance toward C, slipping the left foot to C.\n",
        "32": " Step 31. Move the right foot to C in a stamping motion, forming a right walking stance toward C while executing a high vertical punch to C with a twin fist.\n",
        "33": " Step 32. Move the left foot to A in a stamping motion, forming a left walking stance toward A while executing an upset punch to A with a twin fist.\n",
        "34": " Step 33. Execute a middle front snap kick to A with the right foot, keeping the position of the hands as they were in 32.\n",
        "35": " Step 34. Lower the right foot to the left foot, and then move the left foot to A to form a left L-stance toward B while executing a middle guarding block to B with a knife-hand.\n",
        "36": " Step 35. Move the left foot to B, forming a left walking stance toward B while executing a high punch to B with the left fist.\n",
        "37": " Step 36. Move the right foot to B in stamping motion, forming a right walking stance toward B while executing an upset punch to B with a twin fist.\n",
        "38": " Step 37. Execute a middle front snap kick to B with the left foot, keeping the position of the hands as they were in 36.\n",
        "39": " Step 38. Lower the left foot to the right foot, and then move the right foot to B to form a right L-stance toward A at the same time executing a middle guarding block to A with a knife-hand.\n",
        "40": " Step 39. Move the right foot to A, forming a right walking stance toward A while executing a high punch to A with the right fist.\n",
        "41": " End: Bring the foot back to a ready position\n"
      },
      "title": "Kwang-Gae"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 36\n",
        "1": " Ready Posture: Parallel Stance with a Heaven Hand\n",
        "2": " Step 1. Move the left foot to B, forming a right L-stance toward B while executing a middle guarding block to B with the forearm.\n",
        "3": " Step 2. Pull the right foot to the left knee joint to form a left one-leg stance toward D, at the same time lifting both fists while turning the face toward A.\n",
        "4": " Step 3. Execute a pressing kick to A with the right foot keeping the position of the hands as they were in 2.\n",
        "5": " Step 4. Lower the right foot to A to form a sitting stance toward D while executing a middle side strike to A with the right knife-hand.\n",
        "6": " Step 5. Execute an angle punch with the left fist while maintaining a sitting stance toward D.\n",
        "7": " Step 6. Execute a pressing block with the left, fore fist while executing a side front block with the right inner forearm, maintaining a sitting stance toward D.\n",
        "8": " Step 7. Execute a pressing block with the right fore fist and a side front block with the left inner forearm while maintaining a sitting stance toward D.\n",
        "9": " Step 8. Execute a middle wedging block with the inner forearm while maintaining a sitting stance toward D.\n",
        "10": " Step 9. Thrust to C with the right back elbow supporting the right fore fist with the left palm keeping the face as it was in 8 while maintaining a sitting stance towards D.\n",
        "11": " Step 10. Execute a middle punch to D with the right fist slipping the left palm up to the right elbow joint while maintaining a sitting stance toward D.\n",
        "12": " Step 11. Thrust to C with the left back elbow supporting the left fore fist with right palm, keeping the face as it was in 10 while maintaining a sitting stance toward D.\n",
        "13": " Step 12. Execute a right horizontal punch to A while maintaining a sitting stance toward D. Perform 6 through 12 in a continuous motion.\n",
        "14": " Step 13. Cross the left foot over the right foot forming a right X-stance toward D while executing a low front block to D with the right outer forearm and bringing the left finger belly on the right under forearm.\n",
        "15": " Step 14. Move the right foot to A forming a left L-stance toward A at the same time executing a U-shape grasp to A.\n",
        "16": " Step 15. Bring the left foot to the right foot forming a closed stance toward D while executing a horizontal thrust with a twin elbow, turning the face toward B. Perform in slow motion.\n",
        "17": " Step 16. Move the left foot to B to form a sitting stance toward D while executing a side back strike to C with the right back fist and extending the left arm to the side downward.\n",
        "18": " Step 17. Cross the right foot over the left foot forming a left X-stance toward D while executing a low front block with the left outer forearm and bringing the right finger belly to the left side fist.\n",
        "19": " Step 18. Move the left foot to B to form a sitting stance toward D while executing a low guarding block to B with a reverse knife-hand.\n",
        "20": " Step 19. Execute a forearm middle guarding block to A while forming a left L-stance toward A pivoting with left foot.\n",
        "21": " Step 20. Pull the left foot to the right knee joint to form a right one-leg stance toward D, at the same time lifting both fists while turning the face toward B.\n",
        "22": " Step 21. Execute a pressing kick to B with the left foot keeping the position of the hands as they were in 20.\n",
        "23": " Step 22. Lower the left foot to B to form a sitting stance toward D while executing a middle side strike to B with the left knife-hand.\n",
        "24": " Step 23. Execute an angle punch with the right fist while maintaining a sitting stance toward D.\n",
        "25": " Step 24. Execute a pressing block with the right, fore fist while executing a side front block with the left inner forearm, maintaining a sitting stance toward D.\n",
        "26": " Step 25. Execute a pressing block with the left fore fist and a side front block with the right inner forearm while maintaining a sitting stance toward D.\n",
        "27": " Step 26. Execute a middle wedging block with the inner forearm while maintaining a sitting stance toward D.\n",
        "28": " Step 27. Thrust to C with the left back elbow supporting the left fore fist with the right palm keeping the face as it was in 26 while maintaining a sitting stance towards D.\n",
        "29": " Step 28. Execute a middle punch to D with the left fist slipping the right palm up to the left elbow joint while maintaining a sitting stance toward D.\n",
        "30": " Step 29. Thrust to C with the right back elbow supporting the right fore fist with left palm, keeping the face as it was in 28 while maintaining a sitting stance toward D.\n",
        "31": " Step 30. Execute a left horizontal punch to B while maintaining a sitting stance toward D. Perform 24 through 30 in a continuous motion.\n",
        "32": " Step 31. Cross the right foot over the left foot forming a left X-stance toward D while executing a low front block to D with the left outer forearm and bringing the right finger belly on the left under forearm.\n",
        "33": " Step 32. Move the left foot to B forming a right L-stance toward B at the same time executing a U-shape grasp to B.\n",
        "34": " Step 33. Bring the right foot to the left foot forming a closed stance toward D while executing a horizontal thrust with a twin elbow, turning the face toward A. Perform in slow motion.\n",
        "35": " Step 34. Move the right foot to A to form a sitting stance toward D while executing a side back strike to C with the left back fist and extending the right arm to the side downward.\n",
        "36": " Step 35. Cross the left foot over the right foot forming a right X-stance toward D while executing a low front block with the right outer forearm and bringing the left finger belly to the right side fist.\n",
        "37": " Step 36. Move the right foot to A to form a sitting stance toward D while executing a low guarding block to A with a reverse knife-hand.\n",
        "38": " End: Bring the foot back to a ready position\n"
      },
      "title": "Po-Eun"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 44\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Move the right foot to C forming a right L-stance toward D while executing a checking block D with an X-knife-hand.\n",
        "3": " Step 2. Execute a low twisting kick to D with the right foot keeping the position of the hands as they were in 1.\n",
        "4": " Step 3. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "5": " Step 4. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D. Perform 3 and 4 in a fast motion.\n",
        "6": " Step 5. Move the right foot to C forming a left walking stance toward D while executing a rising block with the left forearm.\n",
        "7": " Step 6. Execute a low block to D with the left forearm while maintaining a left walking stance toward D. Perform 5 and 6 in a continuous motion.\n",
        "8": " Step 7. Execute a high block to AD with a double arc hand while looking through it maintaining a left walking stance toward D.\n",
        "9": " Step 8. Turn the face toward D while forming a right bending ready stance A toward D.\n",
        "10": " Step 9. Lower the left foot to AD to form a sitting stance toward AC while executing a scooping block to AC with the left palm.\n",
        "11": " Step 10. Execute a middle punch to AC with the right fist while maintaining a sitting stance toward AC. Perform 9 and 10 in a connecting motion.\n",
        "12": " Step 11. Execute a front strike to AC with the left back fist while maintaining a sitting stance toward AC.\n",
        "13": " Step 12. Move the right foot on line AB and then move the left foot to C forming a right L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "14": " Step 13. Execute a low side front snap kick to C with the left foot keeping the position of the hands as they were in 12.\n",
        "15": " Step 14. Lower the left foot to C forming a left low stance toward C while executing a high thrust to C with the left flat finger tip.\n",
        "16": " Step 15. Execute a high thrust to C with the right flat finger tip while maintaining a left low stance toward C.\n",
        "17": " Step 16. Execute a middle side piercing kick to C with the right foot while pulling both hands in the opposite direction.\n",
        "18": " Step 17. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "19": " Step 18. Move the right foot to D turning counter clockwise to form a right L-stance toward C while executing a middle guarding block to C with the forearm.\n",
        "20": " Step 19. Move the left foot to D turning counter clockwise to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "21": " Step 20. Move the left foot on line CD to form a sitting stance toward A while executing a right 9-shape block.\n",
        "22": " Step 21. Move the right foot to D, turning counter-clockwise to form a left walking stance toward C while executing a low block to C with the left knife-hand.\n",
        "23": " Step 22. Execute a middle turning kick to BC with the right foot and then lower it to C.\n",
        "24": " Step 23. Execute a flying side piercing kick to C with the right foot. Perform 22 and 23 in a fast motion.\n",
        "25": " Step 24. Land to C to form a right walking stance toward C while executing a high vertical punch to C with a twin fist.\n",
        "26": " Step 25. Execute a high block to AC with a double arc-hand while looking through it maintaining a right walking stance toward C.\n",
        "27": " Step 26. Execute an upset punch to C with the left fist while maintaining a right walking stance toward C.\n",
        "28": " Step 27. Move the right foot on line CD, forming a left walking stance toward D while striking the left palm with the right front elbow..\n",
        "29": " Step 28. Jump to D, forming a right x-stance toward BD while executing a high block to D with the right double forearm.\n",
        "30": " Step 29. Move the left foot to BC to form a sitting stance toward BD, at the same time executing a scooping block to BD with the right palm.\n",
        "31": " Step 30. Execute a middle punch to BD with the left fist while maintaining a sitting stance toward BD. Perform 29 and 30 in a connecting motion.\n",
        "32": " Step 31. Execute a front strike to BD with the right back fist while maintaining a sitting stance toward BD.\n",
        "33": " Step 32. Move the left foot to C, forming a left walking stance toward C, at the same time executing a high front strike to C with the right reverse knife-hand.\n",
        "34": " Step 33. Move the left foot to A about half a shoulder width while executing a middle turning kick to C with the right foot.\n",
        "35": " Step 34. Lower the right foot to C, and then turn counter-clockwise to form a left walking stance toward D, pivoting with the right foot while executing a high vertical punch to D with a twin fist.\n",
        "36": " Step 35. Execute a middle punch to D with the right middle knuckle fist, bringing the left side first in front of the right shoulder while forming a right L-stance toward D pulling the left foot.\n",
        "37": " Step 36. Move the right foot to D to form a sitting stance toward B, at the same time executing left 9-shape block.\n",
        "38": " Step 37. Execute a low guarding block to C with a reverse knife-hand while maintaining a sitting stance toward B.\n",
        "39": " Step 38. Execute a low guarding block to D with a knife-hand while maintaining a sitting stance toward B. Perform 37 and 38 in a continuous motion.\n",
        "40": " Step 39. Move the left foot to D in a stamping motion to form a sitting stance toward A while executing a W-shape block with the outer forearm.\n",
        "41": " Step 40. Move the left foot to C in a stamping motion to form a sitting stance toward B while executing a W-shape block with the outer forearm.\n",
        "42": " Step 41. Move the right foot to C forming a right walking stance toward C while executing a rising block with the right forearm.\n",
        "43": " Step 42. Execute a middle punch to C with the left fist while maintaining a right walking stance toward C.\n",
        "44": " Step 43. Move the right foot on line CD forming a left walking stance toward D while executing a rising block with the left forearm.\n",
        "45": " Step 44. Execute a middle punch to D with the right fist while maintaining a left walking stance toward D.\n",
        "46": " End: Bring the foot back to a ready position\n"
      },
      "title": "Ge-Baek"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 45\n",
        "1": " Ready Posture: Closed Ready Stance D\n",
        "2": " Step 1. Move the right foot to C forming a left walking stance toward D while executing a low inward block to D with the right knife-hand.\n",
        "3": " Step 2. Move the left foot to C forming a right walking stance toward D while executing a high side block to D with the left outer forearm.\n",
        "4": " Step 3. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D.\n",
        "5": " Step 4. Execute a low twisting kick to D with the left foot keeping the position of the hands as they were in 3.\n",
        "6": " Step 5. Lower the left foot to D forming a left walking stance toward D while executing a downward block with an x-fist.\n",
        "7": " Step 6. Execute a rising block with the right knife-hand, maintaining a left walking stance toward D. Perform 5 and 6 in a continuous motion.\n",
        "8": " Step 7. Jump to D, forming a right x-stance toward BD while executing a high side strike to D with the right back fist bringing the left finger belly to the right side fist.\n",
        "9": " Step 8. Move the left foot to C forming a right L-stance toward C while executing a middle punch to C with the left fist.\n",
        "10": " Step 9. Execute a middle reverse turning kick to AC with the right foot.\n",
        "11": " Step 10. Lower the right foot to C in a stamping motion to form a sitting stance toward A while executing a middle side strike to C with the right knife-hand.\n",
        "12": " Step 11. Execute a middle side piercing kick to C with the left foot while turning clockwise pulling both hands in the opposite direction.\n",
        "13": " Step 12. Lower the left foot to C forming a left walking stance toward C while executing a high crescent punch with the right fist.\n",
        "14": " Step 13. Execute a middle turning punch with the left fist while forming a parallel stance toward C pulling the right foot. Perform in slow motion.\n",
        "15": " Step 14. Move the left foot to D forming a right walking stance toward C while executing a low inward block with the left knife-hand.\n",
        "16": " Step 15. Move the right foot to D forming a left walking stance toward C at the same time executing a high side block to C with the right outer forearm.\n",
        "17": " Step 16. Execute a middle punch to C with the left fist while maintaining a left walking stance toward C.\n",
        "18": " Step 17. Execute a low twisting kick to C with the right foot, keeping the position of the hands as they were in 16.\n",
        "19": " Step 18. Lower the right foot to C forming a right waling stance toward C while executing a downward block with an x-fist.\n",
        "20": " Step 19. Execute a rising block with the left knife-hand while maintaining a right walking stance toward C. Perform 18 and 19 in a continuous motion.\n",
        "21": " Step 20. Jump to C forming a left x-stance toward BC while executing a high side strike to C with the left back fist and bringing the right finger belly to the left side fist.\n",
        "22": " Step 21. Move the right foot to D, forming a left L-stance toward D while executing a middle punch to D with the right fist.\n",
        "23": " Step 22. Execute a middle reverse turning kick to AD with the left foot.\n",
        "24": " Step 23. Lower the left foot to D in a stamping motion to form a sitting stance toward A at the same time executing a middle side strike to D with a left knife-hand.\n",
        "25": " Step 24. Execute a middle side piercing kick to D with the right foot while turning counter-clockwise pulling both hands in the opposite direction.\n",
        "26": " Step 25. Lower the right foot to D forming a right walking stance toward D while executing a high crescent punch with the left fist.\n",
        "27": " Step 26. Execute a middle turning punch with the right fist while forming a parallel stance toward D pulling the left foot. Perform in slow motion.\n",
        "28": " Step 27. Move the right foot to D forming a right walking stance toward D at the same time executing a middle wedging block with a knife-hand.\n",
        "29": " Step 28. Execute a circular block to BD with the left reverse knife-hand while maintaining a right walking stance toward D.\n",
        "30": " Step 29. Execute a downward block with an alternate palm while forming a left rear foot stance toward D pulling the right foot.\n",
        "31": " Step 30. Execute a middle punch to D with the left fist while forming a left L-stance toward D slipping the right foot.\n",
        "32": " Step 31. Execute a low inward block to D with the right reverse knife-hand while shifting to C maintaining a left L-stance toward D.\n",
        "33": " Step 32. Move the left foot to D forming a left walking stance toward D while executing a middle wedging block with a knife-hand.\n",
        "34": " Step 33. Execute a circular block to AD with the right reverse knife-hand while maintaining a left walking stance toward D.\n",
        "35": " Step 34. Execute a downward block with an alternate palm while forming a right rear foot stance toward D pulling left foot.\n",
        "36": " Step 35. Execute a middle punch to D with the right fist while forming a right L-stance toward D slipping the left foot.\n",
        "37": " Step 36. Execute a low inward block to D with the left reverse knife-hand while shifting to C maintaining a right L-stance toward D.\n",
        "38": " Step 37. Execute a high reverse turning kick to BD with the right foot.\n",
        "39": " Step 38. Lower the right foot to D forming a left rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
        "40": " Step 39. Execute a high reverse turning kick to AD with the left foot.\n",
        "41": " Step 40. Lower the left foot to D forming a right rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
        "42": " Step 41. Move the left foot to the side rear of the right foot and then the right foot to C forming a right L-stance toward D while executing a low outward block to D with the left knife-hand.\n",
        "43": " Step 42. Execute a middle punch to D with the right fist while forming a left walking stance toward D slipping the right foot.\n",
        "44": " Step 43. Move the left foot to C forming a left L-stance toward D while executing a low block to D with the right knife-hand.\n",
        "45": " Step 44. Execute a middle punch to D with the left fist while forming a right walking stance toward D slipping the left foot.\n",
        "46": " Step 45. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
        "47": " End: Bring the foot back to a ready position\n"
      },
      "title": "Eui-Am"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 52\n",
        "1": " Ready Posture: Closed Ready Stance A\n",
        "2": " Step 1. Move the right foot to A to form a sitting stance toward D while executing a side front block with the right inner forearm and extending the left forearm side-downward.\n",
        "3": " Step 2. Execute a side front block with the left inner forearm extending the right forearm side downward while maintaining a sitting stance toward D.\n",
        "4": " Step 3. Bring the right foot to the left foot forming a closed stance toward D while executing an angle punch with the left fist. Perform in slow motion.\n",
        "5": " Step 4. Move the left foot to D to form a left walking stance toward while executing a high thrust to D with the right double finger.\n",
        "6": " Step 5. Move the right foot to D to form a right walking stance toward while executing a high thrust to D with the left double finger.\n",
        "7": " Step 6. Execute a front strike to D with the right back fist while maintaining a right walking stance toward D.\n",
        "8": " Step 7. Move the left foot to D forming a left walking stance toward D while executing a rising block with the left forearm.\n",
        "9": " Step 8. Move the right foot to D to form a right walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
        "10": " Step 9. Move the right foot to C turning counter clockwise and then slide to C to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "11": " Step 10. Execute a low front snap kick to D with the right foot keeping the position of the hands as they were in 9.\n",
        "12": " Step 11. Lower the right foot to D forming a right low stance toward D while executing a high thrust to D with the right flat finger tip.\n",
        "13": " Step 12. Execute a high turning kick to D with the right foot supporting the body with both hands and the left knee.\n",
        "14": " Step 13. Lower the right foot to D and then execute a high punch to D with the right fist while pressing the ground with the left palm.\n",
        "15": " Step 14. Move the left foot to D turning clockwise to form a left L-stance toward C while thrusting to D with the left side elbow.\n",
        "16": " Step 15. Move the left foot to C turning clockwise to form a left L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
        "17": " Step 16. Move the right foot to C forming a right L-stance toward D while executing a scooping block with the left palm.\n",
        "18": " Step 17. Move the left foot to C forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand.\n",
        "19": " Step 18. Execute a pressing block with an X-fist while forming a left walking stance toward C pivoting with the right foot.\n",
        "20": " Step 19. Execute a low front snap kick to C with the right knee while pulling both hands in the opposite direction as if grabbing the opponent's leg.\n",
        "21": " Step 20. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "22": " Step 21. Move the right foot to D in a sliding motion to form a right L-stance toward C while thrusting to D with the right side elbow.\n",
        "23": " Step 22. Execute a middle guarding block to D with a knife-hand while forming a left L-stance toward D pivoting with the left foot.\n",
        "24": " Step 23. Execute a middle side piercing kick to D with the right foot while pulling both hands in the opposite direction.\n",
        "25": " Step 24. Lower the right foot to D and then execute a pressing block with a twin palm while forming a right rear foot stance toward C, pivoting with the right foot.\n",
        "26": " Step 25. Move the right foot to C to form a right walking stance toward C while executing a high front block to C with the right outer forearm and then a high side strike to C with the right back fist, maintaining a right walking stance toward C.\n",
        "27": " Step 26. Execute a high thrust to D with the left flat finger tip while forming a right L-stance toward D pivoting with the right foot.\n",
        "28": " Step 27. Execute a low front snap kick to D with the right foot while bring the right palm on the left back hand.\n",
        "29": " Step 28. Lower the right foot to D to form a left walking stance toward C pivoting with the left foot while thrusting to D with the right back elbow, placing the left side fist on the right fist. Perform in slow motion.\n",
        "30": " Step 29. Execute a downward strike with the left back hand while forming a right L-stance toward C, pivoting with the right foot. Perform in a stamping motion.\n",
        "31": " Step 30. Punch the left palm with the right fist while maintaining a right L-stance toward C.\n",
        "32": " Step 31. Move the right foot to C in a stamping motion to form a left L-stance toward C while executing a downward strike with the right back hand.\n",
        "33": " Step 32. Punch the right palm with the left fist while maintaining a left L-stance toward C.\n",
        "34": " Step 33. Execute a middle outward strike to D with the left knife-hand while forming a right L-stance toward D, pivoting with the right foot. Perform in a stamping motion.\n",
        "35": " Step 34. Execute a high side front strike to D with the right back fist striking the left palm with the right elbow while forming a left walking stance toward D, slipping the left foot.\n",
        "36": " Step 35. Move the right foot to D forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand. Perform in a stamping motion.\n",
        "37": " Step 36. Execute a high side front strike to D with the left back fist striking the right palm with the left elbow while forming a right walking stance toward D, slipping the right foot.\n",
        "38": " Step 37. Execute a low guarding block to C with a reverse knife-hand while forming a right L-stance toward C pivoting with the right foot.\n",
        "39": " Step 38. Execute a right 9-shape block while forming a left walking stance toward C slipping the left foot.\n",
        "40": " Step 39. Move the right foot to C forming a left L-stance toward C while executing a low guarding block to C with a reverse knife-hand.\n",
        "41": " Step 40. Execute a left 9-shape block while forming a right walking stance toward C slipping the right foot.\n",
        "42": " Step 41. Move the right foot to D forming a left walking stance toward C while executing a horizontal strike with a twin knife-hand.\n",
        "43": " Step 42. Execute a high strike to C with the right arc-hand while maintaining a left walking stance toward C.\n",
        "44": " Step 43. Execute a middle front snap kick to C with the right foot keeping the position of the hands as they were in 42.\n",
        "45": " Step 44. Lower the right foot to C forming a right walking stance toward C while executing a high strike to C with the left arc-hand.\n",
        "46": " Step 45. Execute a middle front snap kick to C with the left foot keeping the position of the hands as they were in 44.\n",
        "47": " Step 46. Lower the left foot to C forming a left walking stance toward C while executing a middle punch to C with the right fist.\n",
        "48": " Step 47. Execute a middle punch to C with the left fist while maintaining a left walking stance toward c. Perform 46 and 47 in a fast motion.\n",
        "49": " Step 48. Bring the right foot to the left foot to form a close stance toward C while executing a high crescent punch with a twin for-knuckle fist.\n",
        "50": " Step 49. Move the left foot to B turning counter-clockwise to form a left walking stance toward B while executing a low block to B with the left knife-hand.\n",
        "51": " Step 50. Execute a high punch to B with the right open fist while maintaining a left walking stance toward B.\n",
        "52": " Step 51. Move the left foot on line AB forming a right walking stance toward A while executing a low block to A with the right Knife-hand.\n",
        "53": " Step 52. Execute a high punch to A with the left open fist while maintaining a right walking stance toward A.\n",
        "54": " End: Bring the foot back to a ready position\n"
      },
      "title": " Choong-Jang "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 45\n",
        "1": " Ready Posture: Parallel Stance with a Twin Elbow\n",
        "2": " Step 1. Move the left foot to B forming a sitting stance toward D while executing a parallel block with the inner forearm.\n",
        "3": " Step 2. Execute a middle hooking block to D with the right palm while standing up toward D.\n",
        "4": " Step 3. Execute a middle punch to D with the left fist while forming a sitting stance toward D.\n",
        "5": " Step 4. Pull the right reverse footsword to the left knee joint forming a left one-leg stance toward D while executing a parallel block with the outer forearm.\n",
        "6": " Step 5. Execute a middle side piercing kick to A and then a high reverse hooking kick to B consecutively with the right foot keeping the position of the hands as they were in 4. Perform in slow motion.\n",
        "7": " Step 6. Lower the right foot to B in a jumping motion to form a right X-stance toward F while executing a downward strike to B with the right back fist.\n",
        "8": " Step 7. Execute a middle hooking kick and then a high side piercing kick to F consecutively with the left foot while pulling both fists in front of the chest.\n",
        "9": " Step 8. Lower the left foot to F in a stamping motion to form a sitting stance toward B while executing a high outward cross-cut to F with the left flat finger tip.\n",
        "10": " Step 9. Execute a right high elbow strike to BF pressing the right side fist with the left palm while forming a left walking stance toward BF.\n",
        "11": " Step 10. Cross the left foot over the right foot to form a right X-stance toward B while executing a low front block to B with the left reverse knife-hand, bringing the right finger belly on the left back forearm.\n",
        "12": " Step 11. Move the right foot to A forming a left L-stance toward A while executing a middle guarding block to A with a knife-hand.\n",
        "13": " Step 12. Execute a mid-air strike to A with a left knife-hand while spinning counter clockwise and then land to A forming a right L-stance toward A with the left arm extended.\n",
        "14": " Step 13. Move the right foot to A to form a sitting stance toward D while executing a parallel block with the inner forearm.\n",
        "15": " Step 14. Execute a middle hooking block to D with the left palm while standing up toward D.\n",
        "16": " Step 15. Execute a middle punch to D with the right fist while forming a sitting stance toward D.\n",
        "17": " Step 16. Pull the left reverse footsword to the right knee joint forming a right one-leg stance toward D while executing a parallel block with the outer forearm.\n",
        "18": " Step 17. Execute a middle side piercing kick to B and then a high reverse hooking kick to A consecutively with the left foot keeping the position of the hands as they were in 16. Perform in slow motion.\n",
        "19": " Step 18. Lower the left foot to A in a jumping motion to form a left X-stance toward E while executing a downward strike to A with the left back fist.\n",
        "20": " Step 19. Execute a middle hooking kick and then a high side piercing kick to E consecutively with the right foot while pulling both fists in front of the chest.\n",
        "21": " Step 20. Lower the right foot to E in a stamping motion to form a sitting stance toward A while executing a high outward cross-cut to E with the right flat finger tip.\n",
        "22": " Step 21. Execute a left high elbow strike to AE pressing the left side fist with the right palm while forming a right walking stance toward AE.\n",
        "23": " Step 22. Cross the right foot over the left foot to form a left X-stance toward A while executing a low front block to A with the right reverse knife-hand, bringing the left finger belly on the right back forearm.\n",
        "24": " Step 23. Move the left foot to B forming a right L-stance toward B while executing a middle guarding block to B with a knife-hand.\n",
        "25": " Step 24. Execute a mid-air strike to B with a right knife-hand while spinning clockwise and then land to B forming a left L-stance toward B with the right arm extended.\n",
        "26": " Step 25. Execute a pick-shape kick to B with the left foot and then lower it to B forming a right rear foot stance toward B while executing a middle guarding block with the forearm.\n",
        "27": " Step 26. Stance toward B while executing a middle guarding block with the forearm. Bring the right foot to the left foot forming a closed stance with a heaven hand toward D Perform in slow motion.\n",
        "28": " Step 27. Slide to C to form a left rear foot stance toward D while executing a downward thrust with the right straight elbow.\n",
        "29": " Step 28. Execute a high crescent strike with the left arc-hand while forming a right walking stance toward D, slipping the right foot.\n",
        "30": " Step 29. Slide to C to form a right rear foot stance toward D while executing a downward thrust with the left straight elbow.\n",
        "31": " Step 30. Execute a high crescent strike with the right arc-hand while forming a left walking stance toward D, slipping the left foot.\n",
        "32": " Step 31. Move the left foot to C forming a right walking stance toward D while executing a high inward strike to D with a twin knife-hand.\n",
        "33": " Step 32. Move the right foot to C forming a left walking stance toward D while executing a downward punch with the right fist.\n",
        "34": " Step 33. Move the left foot to the side rear of the right foot and then slide to C forming a right L-stance toward D while executing a downward block with the left outer forearm.\n",
        "35": " Step 34. Execute a dodging reverse turning kick to D with the right foot while flying away from D and then land to C to form a left L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
        "36": " Step 35. Move the right foot to the side rear of the left foot and then slide to C forming a left L-stance toward D while executing a downward block with the right outer forearm.\n",
        "37": " Step 36. Execute a dodging reverse turning kick to D with the left foot while flying away from D and then land to C to form a right L-stance toward D at the same time executing a middle guarding block to D with the forearm.\n",
        "38": " Step 37. Move the right foot to D and then the left foot to D then execute a flying two direction kick (twisting kick with the left foot, side piercing with the right foot) while flying to D.\n",
        "39": " Step 38. Land to D to form a left diagonal stance toward D while executing a rising block with a twin palm.\n",
        "40": " Step 39. Slide to D forming a right rear foot stance toward C while executing a side thrust to D with the right elbow.\n",
        "41": " Step 40. Turn the face to D while forming a right bending ready stance B toward C and then execute a middle back piercing kick to D with the left foot. Perform in slow motion.\n",
        "42": " Step 41. Lower the left foot to D in a stamping motion forming a right L-stance toward D at the same time executing a horizontal strike to D with the left back fist.\n",
        "43": " Step 42. Execute a high inward cross-cut to D with the right flat finger tip while forming a parallel stance toward D, pulling the right foot.\n",
        "44": " Step 43. Execute a front punch and an upset punch to D consecutively with the right fist while flying to D and then land to D forming a closed stance toward D with the right fist extended.\n",
        "45": " Step 44. Move the right foot to D forming a right walking stance toward D while executing a front downward strike with the left knife-hand.\n",
        "46": " Step 45. Move the left foot to D forming a left walking stance toward D while executing a middle punch to D with the right fist.\n",
        "47": " End: Bring the foot back to a ready position\n"
      },
      "title": " Juche "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 39\n",
        "1": " Ready Posture: Closed Ready Stance C\n",
        "2": " Step 1. Move the right foot to AC to form a sitting stance toward AD, at the same time executing a middle pushing block to AD with the left palm.\n",
        "3": " Step 2. Execute a middle punch to AD with the right fist, maintaining a sitting stance toward AD.\n",
        "4": " Step 3. Move the right foot on line CD, forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "5": " Step 4. Execute a low block to AD with the right outer forearm and a middle side block to D with the left inner forearm, maintaining a right L-stance toward D.\n",
        "6": " Step 5. Move the left foot to BC forming a sitting stance toward BD, at the same time executing a middle pushing block to BD with the right palm.\n",
        "7": " Step 6. Execute a middle punch to BD with the right fist, maintaining a sitting stance toward BD.\n",
        "8": " Step 7. Move the left foot on line CD, forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "9": " Step 8. Execute a low block to BD with the left outer forearm and a middle side block to D with the right inner forearm, maintaining a left L-stance toward D.\n",
        "10": " Step 9. Turn the face toward C forming a left bending ready stance B toward D.\n",
        "11": " Step 10. Execute a middle back piercing kick to C with the right foot.\n",
        "12": " Step 11. Lower the right foot to C, forming a right L-stance toward D while executing a middle block to D with the left knife hand.\n",
        "13": " Step 12. Turn the face toward C forming a right bending ready stance B toward D.\n",
        "14": " Step 13. Execute a middle back piercing kick to C with the left foot.\n",
        "15": " Step 14. Lower the left foot to C, forming a left L-stance toward D while executing a middle block to D with the right knife hand.\n",
        "16": " Step 15. Move the right foot to C, forming a right L-stance toward D while executing a downward thrust to D with the left straight elbow.\n",
        "17": " Step 16. Move the left foot to C, forming a left L-stance toward D while executing a downward thrust to D with the right straight elbow.\n",
        "18": " Step 17. Move the left foot to D to form a left walking stance toward D while executing a pressing block to D with the right palm.\n",
        "19": " Step 18. Move the right foot to D to form a right walking stance toward D while executing a pressing block to D with the left palm.\n",
        "20": " Step 19. Move the right foot to C forming a right L-stance toward D, while executing a downward block to D with the left outer forearm.\n",
        "21": " Step 20. Move the right foot to D forming a left L-stance toward D, while executing a downward block to D with the right outer forearm.\n",
        "22": " Step 21. Move the left foot to D, forming a right rear foot stance toward D, at the same time executing an upward block to D with the left palm.\n",
        "23": " Step 22. Move the right foot to D, forming a left rear foot stance toward D, at the same time executing an upward block to D with the right palm.\n",
        "24": " Step 23. Middle side front snap kick to D with the left foot, keeping the position of the hands as they were in 22. Perform 24 and 25 in a continuous motion.\n",
        "25": " Step 24. Lower the left foot to D, forming a left walking stance toward D while executing a high inward strike to D with a twin knife-hand.\n",
        "26": " Step 25. Execute a rising block with the left knife hand, maintaining a left walking stance toward D.\n",
        "27": " Step 26. Execute a low guarding block to D with a knife hand, while forming a right L-stance toward D, pulling the left foot.\n",
        "28": " Step 27. Execute a downward punch to D with the right fist while forming a left walking stance toward D, slipping the left foot.\n",
        "29": " Step 28. Move the left foot to the side rear of the right foot and then slide to C, forming a right L-stance toward D while executing a middle guarding block to D with a knife hand.\n",
        "30": " Step 29. Jump and land on the same spot, forming a right L-stance toward D while executing a middle guarding block to D with a knife hand.\n",
        "31": " Step 30. Jump to D to form a right X-stance toward BD, while executing a high side strike to D with the right back fist.\n",
        "32": " Step 31. Move the left foot to C, forming a left walking stance toward C, at the same time executing a high side block to C with the left outer forearm.\n",
        "33": " Step 32. Move the left foot on line CD, forming a right walking stance toward D while executing a high side block to D with the right outer forearm.\n",
        "34": " Step 33. Move the left foot to D, forming a right L-stance toward D, at the same time executing an upset punch to D with the right fist and bringing the left side fist in front of the right shoulder.\n",
        "35": " Step 34. Execute a middle hook kick to A with the right foot.\n",
        "36": " Step 35. Lower the right foot to A, forming a left L-stance toward A while executing a high cross cut to A with the right flat finger tip.\n",
        "37": " Step 36. Bring the right foot to the left foot and then execute a middle hook kick to B with the left foot.\n",
        "38": " Step 37. Lower the left foot to B, forming a right L-stance toward B, at the same time executing a high cross cut to B with the left flat finger tip.\n",
        "39": " Step 38. Bring the left foot to the right foot, and then move the right foot to A forming a left L-stance toward A, at the same time executing a high guarding block to A with a knife hand.\n",
        "40": " Step 39. Bring the right foot to the left foot, and then move the left foot to B forming a right L-stance toward B, at the same time executing a high guarding block to B with a knife hand.\n",
        "41": " End: Bring the foot back to a ready position\n"
      },
      "title": " Ko-Dang "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 33\n",
        "1": " Ready Posture: Closed Ready Stance C\n",
        "2": " Step 1. Slide to D forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "3": " Step 2. Move the right foot to D forming a right walking stance toward D while executing a high block to D with the right double forearm.\n",
        "4": " Step 3. Move the left foot to D forming a left walking stance toward D while executing a high side block to D with the right knife-hand and bringing the left palm on the right back forearm.\n",
        "5": " Step 4. Execute a middle twisting kick to A with the right foot keeping the position of the hands as they were in 3.\n",
        "6": " Step 5. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "7": " Step 6. Move the right foot on line CD to form a sitting stance toward B while executing a middle wedging block with a reverse knife-hand.\n",
        "8": " Step 7. Execute a low thrust to C with a right upset finger tip while forming a left walking stance toward C, pivoting with the right foot.\n",
        "9": " Step 8. Execute a high outward block to D with the right outer forearm and a low block to C with the left forearm while forming a right L-stance toward C pulling the left foot.\n",
        "10": " Step 9. Move the right foot to C to form a sitting stance toward A while executing a middle wedging block with a reverse knife-hand.\n",
        "11": " Step 10. Execute a low punch to C with the right double fist while forming a left L-stance toward C, pulling the right foot.\n",
        "12": " Step 11. Move the left foot to C forming a left walking stance toward C while executing a high block to BC with a double arc-hand and looking through it.\n",
        "13": " Step 12. Move the right foot to C forming a right walking stance toward C while executing a middle punch to C with the left fist.\n",
        "14": " Step 13. Move the right foot on line CD to form a right L-stance toward D while executing a low punch to D with the left double fist.\n",
        "15": " Step 14. Move the left foot to B forming a right L-stance toward B while executing a high guarding block to B with a reverse knife-hand.\n",
        "16": " Step 15. Execute a U-shape block to B while forming a left fixed stance toward B, slipping the left foot.\n",
        "17": " Step 16. Execute a sweeping kick to B with the right side sole and then lower it to B forming a right fixed stance toward B while executing a U-shaped block to B.\n",
        "18": " Step 17. Jump and spin counter clockwise, landing on the same spot to form a left L-stance toward B while executing a middle guarding block to B with a knife-hand.\n",
        "19": " Step 18. Execute a middle side piercing kick to B with the right foot while forming a knife-hand guarding block.\n",
        "20": " Step 19. Lower the right foot to the left foot and then move the left foot to A forming a left walking stance toward A while striking the left palm with the right front elbow.\n",
        "21": " Step 20. Move the right foot to A turning counter clockwise to form a left diagonal stance toward D at the same time thrusting to C with the left back elbow supporting the left forefist with the right palm and turning the face to C.\n",
        "22": " Step 21. Execute a pressing block with an X-fist while forming a right walking stance toward AD.\n",
        "23": " Step 22. Move the left foot to A in a stamping motion to form a sitting stance toward C while executing a W-shape block with the outer forearm.\n",
        "24": " Step 23. Execute a middle side piercing kick to A with the left foot while forming a forearm guarding block.\n",
        "25": " Step 24. Lower the left foot on line A and then execute a low guarding block to B with a knife-hand while forming a left L-stance toward B, pivoting the left foot.\n",
        "26": " Step 25. Move the left foot to B forming a right rear stance toward B while executing an upward block with a left palm.\n",
        "27": " Step 26. Move the right foot to B forming a left rear foot stance toward B while executing a pressing block with a twin palm.\n",
        "28": " Step 27. Move the left foot to C in a stamping motion to form a left walking stance toward C while executing an upset punch to C with a twin fist.\n",
        "29": " Step 28. Move the right foot to C forming a left L-stance toward C while executing a low block to C with the right forearm, pulling the left fist under the left armpit.\n",
        "30": " Step 29. Execute a middle punch to C with the left fist while maintaining a left L-stance toward C bringing the right fist over the left shoulder.\n",
        "31": " Step 30. Execute a middle front block with the right forearm while forming a left walking stance toward D, pivoting with the right foot.\n",
        "32": " Step 31. Execute a high punch to D with the left fist while maintaining a left walking stance toward D. Perform 30 and 31 in a continuous motion.\n",
        "33": " Step 32. Execute a low front snap kick to D with the left foot keeping the position of the hands as they were in 31.\n",
        "34": " Step 33. Lower the left foot to D and then move the right foot to D in a stamping motion forming a right walking stance toward D while executing a high vertical punch to D with a twin fist.\n",
        "35": " End: Bring the foot back to a ready position\n"
      },
      "title": " Sam-Il "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 68\n",
        "1": " Ready Posture: Warrior Ready Stance B\n",
        "2": " Step 1. Move the left foot to B to form a sitting stance toward D while extending both elbows to the sides horizontally.\n",
        "3": " Step 2. Execute an angle punch to C with the left fist while sliding to A, maintaining a sitting stance toward D.\n",
        "4": " Step 3. Execute an angle punch to C with the right fist while sliding to B, maintaining a sitting stance toward D. Perform 2 and 3 in a fast motion.\n",
        "5": " Step 4. Execute a middle hooking block to D with the right palm while standing up toward D.\n",
        "6": " Step 5. Execute a middle punch to D with the left fist while forming a sitting stance toward D.\n",
        "7": " Step 6. Execute a middle hooking block to D with the left palm while standing up toward D.\n",
        "8": " Step 7. Execute a middle punch to D with the right fist while forming a sitting stance toward D.\n",
        "9": " Step 8. Move the left foot to BD to form a left walking stance toward BD while executing a high side block to BD with the left outer forearm.\n",
        "10": " Step 9. Execute a circular block to D with the right inner forearm while maintaining a left walking stance toward BD.\n",
        "11": " Step 10. Execute a scooping block with the left palm while forming a sitting stance toward AD.\n",
        "12": " Step 11. Execute a middle punch to AD with the right fist while maintaining a sitting stance toward AD. Perform 10 and 11 in a connecting motion.\n",
        "13": " Step 12. Bring the left foot to the right foot, and then move the right foot to AD to form a right walking stance toward AD while executing a high side block to AD with the right outer forearm.\n",
        "14": " Step 13. Execute a circular block to D with the left inner forearm while maintaining a right walking stance toward AD.\n",
        "15": " Step 14. Execute a scooping block with the right palm while forming a sitting stance toward BD.\n",
        "16": " Step 15. Execute a middle punch to BD with the left fist while maintaining a right walking stance toward BD. Perform 14 and 15 in a connecting motion.\n",
        "17": " Step 16. Execute a high hooking block to BC with the right palm while forming a left walking stance toward BC.\n",
        "18": " Step 17. Execute a middle punch to BD with the left fist while forming a sitting stance toward BD.\n",
        "19": " Step 18. Execute a high hooking block to AD with the left palm while forming a right walking stance toward AD.\n",
        "20": " Step 19. Execute a middle punch to BD with the right fist while forming sitting stance toward BD. Perform 16, 17, 18 and 19 in a continuous motion.\n",
        "21": " Step 20. Move the right foot to C, forming a left walking stance toward D at the same time executing a pressing block with an X-fist.\n",
        "22": " Step 21. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D. Perform 20 and 21 in a continuous motion.\n",
        "23": " Step 22. Execute a middle punch to D with the right fist, slipping the left palm up to the right elbow joint while maintaining a left walking stance toward D.\n",
        "24": " Step 23. Execute a low front snap kick to D with the right foot, keeping the position of the hands as they were in 22.\n",
        "25": " Step 24. Lower the right foot to D, forming a right walking stance toward D while executing a middle punch to D with the left fist.\n",
        "26": " Step 25. Execute a pressing block with an X-fist while maintaining a right walking stance toward D.\n",
        "27": " Step 26. Execute a rising block with an X-knife-hand while maintaining a right walking stance toward D. Perform 25 and 26 in a continuous motion.\n",
        "28": " Step 27. Execute a middle punch to D with the left fist slipping the right palm up to the left elbow joint while maintaining a right walking stance toward D.\n",
        "29": " Step 28. Execute a low front snap kick to D with the left foot, keeping the position of the hands as they were in 27.\n",
        "30": " Step 29. Lower the left foot to D to form a left walking stance toward D while executing a middle punch to D with the right fist.\n",
        "31": " Step 30. Move the right foot to D, forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "32": " Step 31. Move the left foot to D to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "33": " Step 32. Move the left foot to C, forming a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "34": " Step 33. Move the right foot to C to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "35": " Step 34. Move the right foot to D, forming a right walking stance toward D while executing a high block to D with the right double forearm.\n",
        "36": " Step 35. Execute a low block to D with the left forearm, keeping the right forearm as it was in 34 while maintaining a right walking stance toward D. Perform 34 and 35 in a fast motion.\n",
        "37": " Step 36. Move the left foot to D to form a left walking stance toward D while executing a high block to D with the left double forearm.\n",
        "38": " Step 37. Execute a low block to D with the right forearm, keeping the left forearm as it was in 36 while maintaining a left walking stance toward D. Perform 36 and 37 in a fast motion.\n",
        "39": " Step 38. Move the right foot to D, forming aright walking stance toward D while executing a middle punch to D with the right fist.\n",
        "40": " Step 39. Move the left foot on line CD, and then turn counter-clockwise, pivoting with the left foot to form a right L-stance toward C while executing a high block to C with the left reverse knife-hand.\n",
        "41": " Step 40. Bring the right foot to the left foot to form a closed ready stance C toward C.\n",
        "42": " Step 41. Move the right foot to CF in a stamping motion to form a right walking stance toward CF at the same time executing an upset punch to CF with a twin fist.\n",
        "43": " Step 42. Bring the right foot to the left foot, and then move the left foot to CE in a stamping motion, forming a left walking stance toward CE while executing an upset punch to CE with a twin fist.\n",
        "44": " Step 43. Bring the left foot to the right foot, and then move the right foot to F to form a left L-stance toward F while executing a middle block to F with the right inner forearm.\n",
        "45": " Step 44. Execute a middle punch to F with the left fist while maintaining a left L-stance toward F.\n",
        "46": " Step 45. Bring the left foot to the right foot to form a closed stance toward C while executing an angle punch with the right fist. Perform in a slow motion.\n",
        "47": " Step 46. Move the left foot to E to form a right L-stance toward E while executing a middle block to E with the left inner forearm.\n",
        "48": " Step 47. Execute a middle punch to E with the right fist while maintaining a right L-stance toward E.\n",
        "49": " Step 48. Bring the right foot to the left foot to form a close stance toward C while executing an angle punch with the left fist. Perform in a slow motion.\n",
        "50": " Step 49. Move the left foot to E to form a left fixed stance toward E while executing a U-shape punch to E.\n",
        "51": " Step 50. Bring the left foot to the right foot, and then move the right foot to E, forming a right fixed stance toward E while executing a U-shape punch to E.\n",
        "52": " Step 51. Move the right foot on line CD in a stamping motion to form a sitting stance toward E while executing a front strike to E with the right back fist.\n",
        "53": " Step 52. Execute a waving kick to D with the right foot, and then a high outward block to AC with the right outer forearm, keeping the position of the hands as they were in 51 while forming a sitting stance toward E.\n",
        "54": " Step 53. Execute a waving kick to C with the left foot, and then a high front block to ED with the right outer forearm, keeping the position of the hands as they were in 52 while forming a sitting stance toward E.\n",
        "55": " Step 54. Execute a horizontal strike to C with the right back hand while maintaining a sitting stance toward E.\n",
        "56": " Step 55. Execute a middle crescent kick to the right palm with the left foot.\n",
        "57": " Step 56. Execute a middle side piercing kick to C with the left foot forming a forearm guarding block. Perform 55 and 56 in a consecutive kick.\n",
        "58": " Step 57. Lower the left foot to C to form a sitting stance toward B while executing a horizontal strike to C with the left back hand.\n",
        "59": " Step 58. Execute a middle crescent kick to the left palm with the right foot.\n",
        "60": " Step 59. Execute a middle side piercing kick to C with the right foot, forming a forearm guarding block. Perform 58 and 59 in a consecutive kick.\n",
        "61": " Step 60. Lower the right foot to C, forming a sitting stance toward A while executing a right 9-shape block.\n",
        "62": " Step 61. Change the position of the hands while maintaining a sitting stance toward A.\n",
        "63": " Step 62. Move the left foot to C, turning clockwise to form a sitting stance toward B while executing a right 9-shape block.\n",
        "64": " Step 63. Change the position of the hands while maintaining a sitting stance toward B.\n",
        "65": " Step 64. Execute a downward strike to D with the right side fist while forming a left vertical stance toward, pulling the left foot.\n",
        "66": " Step 65. Move the right foot to A to form a left walking stance toward B while executing a high vertical punch to B with a twin fist.\n",
        "67": " Step 66. Move the right foot to B, turning counter-clockwise to form a left walking stance toward A while executing a high vertical punch to A with a twin fist.\n",
        "68": " Step 67. Bring the right foot to the left foot, and ten move the left foot to BD to form a right L-stance toward BD while executing a middle guarding block to BD with a knife-hand.\n",
        "69": " Step 68. Bring the left foot to the right foot, and then move the right foot to AD to form a left L-stance toward AD while executing a middle guarding block to AD with a knife-hand.\n",
        "70": " End: Bring the foot back to a ready position\n"
      },
      "title": " Yoo-Sin "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 46\n",
        "1": " Ready Posture: Closed Ready Stance C\n",
        "2": " Step 1. Move the left foot to D to form a right rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
        "3": " Step 2. Execute a high punch to D with the left middle knuckle fist while maintaining a right rear foot stance toward D.\n",
        "4": " Step 3. Move the left foot on line CD to form a left rear foot stance toward C while executing a middle guarding block to C with the forearm.\n",
        "5": " Step 4. Execute a high punch to C with the right middle knuckle fist while maintaining a left rear foot stance toward C.\n",
        "6": " Step 5. Move the right foot on line CD to form a left walking stance toward D while executing a rising block with the left knife-hand.\n",
        "7": " Step 6. Execute a circular block to AD with the right inner forearm while maintaining a left walking stance toward D.\n",
        "8": " Step 7. Execute a middle punch to D with the left fist while maintaining a left walking stance toward D.\n",
        "9": " Step 8. Move the left foot on line CD to form a right walking stance toward C while executing a rising block with the right knife-hand.\n",
        "10": " Step 9. Execute a circular block to AC with the left inner forearm while maintaining a right walking stance toward C.\n",
        "11": " Step 10. Execute a middle punch to C with the right fist while maintaining a right walking stance toward C.\n",
        "12": " Step 11. Move the right foot on line CD to form a right L-stance toward D while executing a low guarding block to D with a knife-hand.\n",
        "13": " Step 12. Execute a middle turning kick to AD with the right foot and then lower it to the side front of the left foot.\n",
        "14": " Step 13. Execute a high reverse hooking kick to D with the left foot.\n",
        "15": " Step 14. Execute a middle side piercing kick to D with the left foot, pulling both hands in the opposite direction. Perform 13 and 14 in a consecutive kick.\n",
        "16": " Step 15. Lower the left foot to D forming a left walking stance toward D while striking the left palm with the right front elbow.\n",
        "17": " Step 16. Move the left foot on line CD to form a left L-stance toward C while executing a low guarding block to C with a knife-hand.\n",
        "18": " Step 17. Execute a middle turning kick to AC with the left foot and then lower it to the side front of the right foot.\n",
        "19": " Step 18. Execute a high reverse hooking kick to C with the right foot.\n",
        "20": " Step 19. Execute a middle side piercing kick to C with the right foot, pulling both hands in the opposite direction. Perform 18 and 19 in a consecutive kick.\n",
        "21": " Step 20. Lower the right foot to C forming a right walking stance toward C while striking the right palm with the left front elbow.\n",
        "22": " Step 21. Move the left foot to C to form a left walking stance toward C while executing a pressing block with the right palm.\n",
        "23": " Step 22. Move the right foot to C forming a right walking stance toward C while executing a pressing block with the left palm. Perform 21 and 22 in a fast motion.\n",
        "24": " Step 23. Move the right foot to D and then the left foot to D, turning counter clockwise to form a left walking stance toward D while executing a W-shape block with a knife-hand.\n",
        "25": " Step 24. Execute a middle front snap kick to D with the right foot keeping the position of the hands as they were in 23.\n",
        "26": " Step 25. Lower the right foot to C forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "27": " Step 26. Move the right foot to D to form a right walking stance toward D while executing a W-shape block with a knife-hand.\n",
        "28": " Step 27. Execute a middle front snap kick to D with the left foot keeping the position of the hands as they were in 26.\n",
        "29": " Step 28. Lower the left foot to d forming a left L-stance toward C while executing a middle guarding block to C with the forearm.\n",
        "30": " Step 29. Move the left foot to C and the right foot to C then slide to C turning clockwise to form a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "31": " Step 30. Move the left foot to D forming a left walking stance toward D while executing a high thrust to D with the left flat fingertip.\n",
        "32": " Step 31. Move the left foot on line CD forming a right walking stance toward C while executing a high thrust to C with the right flat fingertip.\n",
        "33": " Step 32. Move the right foot to D turning clockwise to form a parallel stance toward B while executing a middle hooking block to B with the right palm.\n",
        "34": " Step 33. Execute a middle punch to B with the left fist while maintaining a parallel stance toward B.\n",
        "35": " Step 34. Turn the face toward A while forming a left bending ready stance A toward A.\n",
        "36": " Step 35. Execute a middle side piercing kick to A with the right foot forming a forearm guarding block.\n",
        "37": " Step 36. Lower the right foot to A in a jumping motion to form a right X-stance toward AD while executing a high side strike to A with the right back fist and bringing the left finger belly to the right side fist.\n",
        "38": " Step 37. Execute a high reverse hooking kick to B with the right foot.\n",
        "39": " Step 38. Lower the right foot to B in a stamping motion to form a left L-stance toward B while executing a middle outward strike to B with the right knife-hand.\n",
        "40": " Step 39. Move the left foot to D turning counter-clockwise to form a parallel stance toward A at the same time executing a middle hooking block to A with the left palm.\n",
        "41": " Step 40. Execute a middle punch to A with the right fist while maintaining a parallel stance toward A.\n",
        "42": " Step 41. Turn the face to B while forming a right bending ready stance A toward B.\n",
        "43": " Step 42. Execute a middle side piercing kick to B with the left foot forming a forearm guarding block.\n",
        "44": " Step 43. Lower the left foot to B in a jumping motion forming a left X-stance toward BD while executing a high side strike to B with the left back fist and bringing the right finger belly to the left side fist.\n",
        "45": " Step 44. Execute a high reverse hooking kick to A with the left foot.\n",
        "46": " Step 45. Lower the left foot to A in a stamping motion to form a right L-stance toward A while executing a middle outward strike to A with the left knife-hand.\n",
        "47": " Step 46. Slide to A to form a right fixed stance toward A while executing a middle punch to A with the right fist.\n",
        "48": " End: Bring the foot back to a ready position\n"
      },
      "title": " Choi-Yong "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 49\n",
        "1": " Ready Posture: Warrior Ready Stance A\n",
        "2": " Step 1. Slide to C to form a right L-stance toward D while executing a low guarding block to D with a reverse knife-hand. Perform in a circular motion.\n",
        "3": " Step 2. Execute a high punch to D with the right long fist while forming a left walking stance toward D pivoting with the left foot. Perform in slow motion.\n",
        "4": " Step 3. Slide to C forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "5": " Step 4. Execute a middle outward strike to D with the right knife-hand while flying to D and then land to D forming a left L-stance toward D with the right knife-hand extended to D.\n",
        "6": " Step 5. Shift to C maintaining a left L-stance toward D while executing a checking block to D with an X-fist.\n",
        "7": " Step 6. Execute a high outward cross-cut to D with the right flat finger tip while forming a right walking stance toward D, slipping the right foot.\n",
        "8": " Step 7. Execute a downward thrust with the right straight elbow while forming a left rear foot stance toward D, pulling the right foot.\n",
        "9": " Step 8. Jump to D forming a left X-stance toward AD while executing a high side strike to D with the left back fist.\n",
        "10": " Step 9. Move the right foot to C to form a left walking stance toward D while executing a low outward block to D with the right knife-hand.\n",
        "11": " Step 10. Move the right foot on line AB to form a parallel stance toward D while executing a middle hooking block to D with the left palm.\n",
        "12": " Step 11. Execute a middle punch to D with the right fist while maintaining a parallel stance toward D.\n",
        "13": " Step 12. Slide to C forming a left L-stance toward D while executing a low guarding block to D with a reverse knife-hand. Perform in a circular motion.\n",
        "14": " Step 13. Execute a high punch to D with the left long fist while forming a right walking stance toward D, pivoting with the right foot. Perform in slow motion.\n",
        "15": " Step 14. Slide to C forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "16": " Step 15. Execute a middle outward strike to D with the left knife-hand while flying to D and then land to D forming a right L-stance toward D with the left knife-hand extended to D.\n",
        "17": " Step 16. Shift to C maintaining a right L-stance toward D while executing a checking block to D with an X-fist.\n",
        "18": " Step 17. Execute a high outward cross-cut to D with the left flat finger tip while forming a left walking stance toward D, slipping the left foot.\n",
        "19": " Step 18. Execute a downward thrust with the left straight elbow while forming a right rear foot stance toward D, pulling the left foot.\n",
        "20": " Step 19. Jump to D forming a right X-stance toward BD while executing a high side strike to D with the right back fist.\n",
        "21": " Step 20. Move the left foot to C to form a right walking stance toward D while executing a low outward block to D with the left knife-hand.\n",
        "22": " Step 21. Move the left foot on line AB to form a parallel stance toward D while executing a middle hooking block to D with the right palm.\n",
        "23": " Step 22. Execute a middle punch to D with the left fist while maintaining a parallel stance toward D.\n",
        "24": " Step 23. Move the right foot to A to form a sitting stance toward D while executing a W-shape block with the reverse knife-hand.\n",
        "25": " Step 24. Cross the left foot over the right foot to form a right X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
        "26": " Step 25. Move the right foot to A forming a sitting stance toward D while executing a checking block to D with a twin straight forearm.\n",
        "27": " Step 26. Cross the left foot over the right foot to form a right X-stance toward D while executing an upward punch with the right fist, pulling the left side fist in front of the right shoulder.\n",
        "28": " Step 27. Execute a high reverse hooking kick to B with the right foot.\n",
        "29": " Step 28. Lower the right foot to B and then execute a high side piercing kick to B with the left foot pulling both hands in front of the chest while turning clockwise.\n",
        "30": " Step 29. Lower the left foot to B in a jumping motion to form a left X-stance toward BD while executing a downward strike to B with the left backfist.\n",
        "31": " Step 30. Move the left foot to B to form a sitting stance toward D while executing a W-shape block with the reverse knife-hand.\n",
        "32": " Step 31. Cross the right foot over the left foot to form a left X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
        "33": " Step 32. Move the left foot to B forming a sitting stance toward D while executing a checking block to D with a twin straight forearm.\n",
        "34": " Step 33. Cross the right foot over the left foot to form a left X-stance toward D while executing an upward punch with the left fist, pulling the right side fist in front of the left shoulder.\n",
        "35": " Step 34. Execute a high reverse hooking kick to A with the left foot.\n",
        "36": " Step 35. Lower the left foot to A and then execute a high side piercing kick to A with the right foot pulling both hands in front of the chest while turning counter clockwise.\n",
        "37": " Step 36. Lower the right foot to A in a jumping motion to form a right X-stance toward AD while executing a downward strike to A with the right backfist.\n",
        "38": " Step 37. Move the left foot to C forming a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "39": " Step 38. Move the left foot to D turning counter clockwise to form a left rear foot stance toward C while executing a waist block to C with the right inner forearm.\n",
        "40": " Step 39. Move the right foot to C slightly and then the left foot to D in a stamping motion to form a right L-stance toward D while executing a high outward strike to D with the left knife-hand.\n",
        "41": " Step 40. Shift to C maintaining a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "42": " Step 41. Move the right foot to D turning clockwise to form a right rear foot stance toward C while executing a waist block to C with the left inner forearm.\n",
        "43": " Step 42. Move the left foot to C slightly and then the right foot to D in a stamping motion to form a left L-stance toward D while executing a high outward strike to D with the right knife-hand.\n",
        "44": " Step 43. Move the right foot to C turning counter clockwise to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "45": " Step 44. Jump to execute a mid-air kick to D with the right foot while spinning clockwise and then land to D to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "46": " Step 45. Jump to execute a mid-air kick to D with the left foot while spinning counter clockwise and then land to D to form a right L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "47": " Step 46. Execute a low inward block to D with the right reverse knife-hand pulling the left side fist in front of the right shoulder while forming a left walking stance toward D, slipping the right foot to C.\n",
        "48": " Step 47. Slide to C to form a left L-stance toward D while thrusting to C with the left side elbow.\n",
        "49": " Step 48. Execute a low inward block to D with the left reverse knife-hand pulling the right side fist in front of the left shoulder while forming a right walking stance toward D, slipping the left foot to C.\n",
        "50": " Step 49. Slide to C forming a right L-stance toward D while thrusting to C with the right side elbow\n",
        "51": " End: Bring the foot back to a ready position\n"
      },
      "title": "Yon-Gae"
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 42\n",
        "1": " Ready Posture: Parallel Stance with an X-Back Hand\n",
        "2": " Step 1. Move the left foot to C forming a right walking stance toward D while executing a horizontal strike with twin side fists.\n",
        "3": " Step 2. Move the right foot to C to form a left walking stance toward D while executing a pressing block with an X-fist.\n",
        "4": " Step 3. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D. Perform 2 and 3 in a continuous motion.\n",
        "5": " Step 4. Execute a high front strike to D with the right knife-hand bringing the left palm on the right elbow joint while maintaining a left walking stance toward D.\n",
        "6": " Step 5. Move the left foot to C to form a sitting stance toward B while executing a horizontal strike to C with the left back hand.\n",
        "7": " Step 6. Execute a middle crescent kick to the left palm with the right foot.\n",
        "8": " Step 7. Lower the right foot to C, forming a sitting stance toward A while striking the left palm with the right front elbow.\n",
        "9": " Step 8. Thrust to B with the left back elbow placing the right side fist on the left fist while maintaining a sitting stance toward A.\n",
        "10": " Step 9. Execute a side back strike to B with the right back fist and extending the left arm to the side-downward while maintaining a sitting stance toward A.\n",
        "11": " Step 10. Bring the left foot to the right foot, forming a close stance toward D, at the same time thrusting with a twin side elbow.\n",
        "12": " Step 11. Cross the left foot to the right foot, forming a close stance toward D while turning the face to A, Keeping the position of the hands as they were in 10. Perform in a fast motion.\n",
        "13": " Step 12. Execute a middle side piercing kick to A with the right foot keeping the position of the hands as they were in 11.\n",
        "14": " Step 13. Lower the right foot to A, and then cross the left foot over the right foot, forming a right X-stance toward D while executing a horizontal thrust with a twin elbow.\n",
        "15": " Step 14. Move the right foot to A to form the sitting stance toward D while executing a right horizontal punch to A.\n",
        "16": " Step 15. Execute a high front strike to D with right knife-hand, bringing the left back hand in front of the forehead while standing up toward D.\n",
        "17": " Step 16. Execute a twin knife-hand block to B while forming a right L-stance toward B, pivoting with the right foot.\n",
        "18": " Step 17. Jump to execute a mid-air kick to B with the right foot while spinning clockwise.\n",
        "19": " Step 18. Land to B forming a right walking stance toward B while executing a middle block to B with the right double forearm.\n",
        "20": " Step 19. Bring the left foot to the right foot to form a closed ready stance B toward D.\n",
        "21": " Step 20. Jump to D forming a right X-stance toward BD while executing a high side strike to B with the right back fist bringing the left finger belly to the right side fist.\n",
        "22": " Step 21. Move the left foot to C to form a right walking stance toward D while executing a rising block with the left forearm.\n",
        "23": " Step 22. Execute a middle front snap kick to D with the left foot keeping the position of the hands as they were in 21.\n",
        "24": " Step 23. Lower the left foot to D forming a left walking stance toward D while executing a high punch to D with the right fist.\n",
        "25": " Step 24. Move the right foot to D to form a right walking stance toward D while executing a middle thrust to D with the right straight fingertip.\n",
        "26": " Step 25. Move the left foot to D turning counter-clockwise to form a sitting stance toward A while executing a high side strike to D with the left back fist.\n",
        "27": " Step 26. Move the right foot to F turning counter-clockwise to form a right walking ready stance toward F.\n",
        "28": " Step 27. Jump to execute a flying high kick to F with the right foot.\n",
        "29": " Step 28. Land to F to form a right fixed stance toward F while executing a checking block to F with an X-knife hand.\n",
        "30": " Step 29. Move the left foot to F forming a right L-stance toward F while executing a pressing block with an X-fist.\n",
        "31": " Step 30. Execute a middle side front snap kick to F with the left foot while executing a middle wedging block with the inner forearm. Execute a middle side front snap kick to F with the left foot while executing a middle wedging block with the inner forearm.\n",
        "32": " Step 31. Lower the left foot to F forming a left walking stance toward F while executing a high vertical punch to F with a twin fist.\n",
        "33": " Step 32. Move the right foot to F to form a right fixed stance toward F while executing a middle outward block with the right knife hand and a middle pushing block with the left palm.\n",
        "34": " Step 33. Slide to F forming a right L-stance toward F while executing a middle punch to F with the left fist.\n",
        "35": " Step 34. Move the left foot to the side rear of the right foot and the right foot to E to form a right L-stance toward F and then jump to E maintaining a right L-stance towards F while executing a middle guarding block to F with the forearm.\n",
        "36": " Step 35. Execute a middle turning kick to DF with the right foot.\n",
        "37": " Step 36. Lower the right foot to F and then execute a middle back piercing kick to F with the left foot.\n",
        "38": " Step 37. Lower the left foot to F to form a right L-stance toward F while executing a middle guarding block to F with the forearm.\n",
        "39": " Step 38. Move the left foot to E forming a left l-stance toward F while executing an upward block to F with the right palm.\n",
        "40": " Step 39. Move the right foot to E forming a right walking stance to E while executing a circular block to ED with the left inner forearm.\n",
        "41": " Step 40. Execute a circular block to DE with the right inner forearm while forming a right walking stance toward DF.\n",
        "42": " Step 41. Move the left foot on line EF to form a sitting stance toward D while executing a middle punch to D with the left fist.\n",
        "43": " Step 42. Execute a middle punch to D with the right fist while maintaining a sitting stance toward D.\n",
        "44": " End: Bring the foot back to a ready position\n"
      },
      "title": " Ul-Ji "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 61\n",
        "1": " Ready Posture: Parallel Ready Stance\n",
        "2": " Step 1. Turn the face to B while forming a right bending ready A toward B. Perform in a slow motion.\n",
        "3": " Step 2. Execute a high side piercing kick to B with the left foot. Perform in a slow motion.\n",
        "4": " Step 3. Execute a high side piercing kick to B with the left foot. Perform 2 and 3 in a double kick.\n",
        "5": " Step 4. Lower the left foot to B to form a sitting stance toward D while executing a middle thrust to D with the right flat fingertip.\n",
        "6": " Step 5. Execute a high reverse hooking kick to B with the right foot. Perform in a slow motion.\n",
        "7": " Step 6. Lower the right foot to B in a jumping motion to form a right X-stance toward C while executing a middle side strike to B with the right knife-hand.\n",
        "8": " Step 7. Move the left foot to A forming a left walking stance toward A while executing a pressing block to A with the right palm.\n",
        "9": " Step 8. Move the right foot to A to form a right walking stance toward A at the same time executing a pressing block with the left palm.\n",
        "10": " Step 9. Execute a high side block to B with the left knife-hand and a low side block to A with the right knife-hand while forming a right one-leg stance toward D, pulling the left reverse footsword to the right knee joint. Perform in slow motion.\n",
        "11": " Step 10. Lower the left foot to the right foot and then turn the face to A while forming a left bending ready stance A toward A. Perform in slow motion.\n",
        "12": " Step 11. Execute a high side piercing kick to A with the right foot. Perform in a slow motion.\n",
        "13": " Step 12. Execute a high side piercing kick to A with the right foot. Perform 11 and 12 in a double kick.\n",
        "14": " Step 13. Lower the right foot to a to form a sitting stance toward D while executing a middle thrust to D with the left flat fingertip.\n",
        "15": " Step 14. Execute a high reverse hooking kick to A with the left foot. Perform in a slow motion.\n",
        "16": " Step 15. Lower the left foot to A in a jumping motion to form a left X-stance toward C while executing a middle side strike to A with the left knife-hand.\n",
        "17": " Step 16. Move the right foot to B forming a right walking stance toward B while executing a pressing block to B with the left palm.\n",
        "18": " Step 17. Move the left foot to B to form a left walking stance toward B at the same time executing a pressing block with the right palm.\n",
        "19": " Step 18. Execute a high side block to A with the right knife-hand and a low side block to B with the left knife-hand while forming a left one-leg stance toward D, pulling the right reverse footsword to the left knee joint. Perform in slow motion.\n",
        "20": " Step 19. Turn the face to C while forming a left bending ready stance B toward D.\n",
        "21": " Step 20. Execute a high back piercing kick to C with the right foot. Perform in slow motion.\n",
        "22": " Step 21. Lower the right foot to C to form a left walking stance toward D while executing a middle punch to D with the right fist.\n",
        "23": " Step 22. Turn the face to C while forming a right bending ready stance B toward D.\n",
        "24": " Step 23. Execute a high back piercing kick to C with the left foot. Perform in slow motion.\n",
        "25": " Step 24. Lower the left foot to C to form a right walking stance toward D while executing a middle punch to D with the left fist.\n",
        "26": " Step 25. Slide to C forming a right rear foot stance toward D while executing a downward block with the left palm.\n",
        "27": " Step 26. Execute a middle side front snap kick to D with the left foot keeping the position of the hands as they were in 25.\n",
        "28": " Step 27. Lower the left foot to D and then move the right foot to C in a stamping motion to form a sitting stance toward A while executing a middle side strike to C with the right side fist.\n",
        "29": " Step 28. Slide to C maintaining a sitting stance toward A while executing a scooping block with the left palm.\n",
        "30": " Step 29. Execute a middle punch to A with the right fist while maintaining a sitting stance toward A. Perform 28 and 29 in a connecting motion.\n",
        "31": " Step 30. Execute a low side block to D with the left knife-hand while maintaining a sitting stance toward A.\n",
        "32": " Step 31. Move the left foot just beyond the right foot in a quick motion while executing a middle side pushing kick to C with the right foot.\n",
        "33": " Step 32. Lower the right foot to C and then execute a high reverse turning kick to C with the left foot.\n",
        "34": " Step 33. Lower the left foot to C to form a left walking stance toward C while executing a high side block to C with the left knife-hand.\n",
        "35": " Step 34. Slide to D forming a left rear foot stance toward C while executing a downward block with the right palm.\n",
        "36": " Step 35. Execute a middle side front snap kick to C with the right foot keeping the position of the hands as they were in 34.\n",
        "37": " Step 36. Lower the right foot to C and then move the left foot to D in a stamping motion to form a sitting stance toward A while executing a middle side strike to D with the left side fist.\n",
        "38": " Step 37. Slide to D maintaining a sitting stance toward A while executing a scooping block with the right palm.\n",
        "39": " Step 38. Execute a middle punch to A with the left fist while maintaining a sitting stance toward A. Perform 37 and 38 in a connecting motion.\n",
        "40": " Step 39. Execute a low side block to C with the right knife-hand while maintaining a sitting stance toward A.\n",
        "41": " Step 40. Move the right foot just beyond the left foot in a quick motion while executing a middle side pushing kick to D with the left foot.\n",
        "42": " Step 41. Lower the left foot to D and then execute a high reverse turning kick to D with the right foot.\n",
        "43": " Step 42. Lower the right foot to D to form a right walking stance toward D while executing a high side block to D with the right knife-hand.\n",
        "44": " Step 43. Move the left foot to D and then execute a high twisting kick to AD with the right foot.\n",
        "45": " Step 44. Lower the right foot to C forming a left walking stance toward D while executing a side back strike to C with the right back fist and extending the left fist to D.\n",
        "46": " Step 45. Execute a front strike to D with the right back fist while shifting to C maintaining a left walking stance toward D.\n",
        "47": " Step 46. Move the right foot to D and then execute a high twisting kick to BD with the left foot.\n",
        "48": " Step 47. Lower the left foot to C to form a right walking stance toward D while executing a side back strike to C with the left back fist and extending the right fist to D.\n",
        "49": " Step 48. Execute a front strike to D with the left back fist while shifting to C maintaining a right walking stance toward D.\n",
        "50": " Step 49. Execute a sweeping kick to D with the left side sole keeping the position of the hands as they were in 48 and then lower it to D forming a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "51": " Step 50. Execute a side checking kick to D and then again a middle side thrusting kick to D with the left foot forming a forearm guarding block. Perform in a consecutive kick.\n",
        "52": " Step 51. Lower the left foot to D forming a right L-stance toward D while executing a middle outward strike to D with the left knife-hand.\n",
        "53": " Step 52. Execute a sweeping kick to D with the right side sole and then lower it to D to form a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "54": " Step 53. Execute a side checking kick to D and then again a middle side thrusting kick to D with the right foot forming a forearm guarding block. Perform in a consecutive kick.\n",
        "55": " Step 54. Lower the right foot to D forming a left L-stance toward D while executing a middle outward strike to D with the right knife-hand.\n",
        "56": " Step 55. Move the right foot to C and then turn counter clockwise pivoting with the right foot to form a left walking stance toward C while executing a middle punch to C with the right fist.\n",
        "57": " Step 56. Jump to C to form a right X-stance toward AC while executing a low punch to C with the left fist and bringing the right fist on the left shoulder.\n",
        "58": " Step 57. Jump to D forming a left X-stance toward AD while executing a low punch to D with the right fist and bringing the left fist on the right shoulder.\n",
        "59": " Step 58. Jump to execute a mid-air kick to D with the right foot while spinning clockwise.\n",
        "60": " Step 59. Land to D to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "61": " Step 60. Move the right foot to the side rear of the left foot and then the left foot to C to form a right walking stance toward D while executing a rising block with the left arc-hand.\n",
        "62": " Step 61. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
        "63": " End: Bring the foot back to a ready position\n"
      },
      "title": " Moon-Moo "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 72\n",
        "1": " Ready Posture: Closed Ready Stance A\n",
        "2": " Step 1. Slide to C to form a right rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
        "3": " Step 2. Execute a middle vertical punch to D with the right fist while forming a left walking stance toward D, slipping the left foot.\n",
        "4": " Step 3. Slide to C to form a left rear foot stance toward D while executing a middle guarding block to D with the forearm.\n",
        "5": " Step 4. Execute a middle vertical punch to D with the left fist while forming a right walking stance toward D, slipping the right foot.\n",
        "6": " Step 5. Execute a high side block to BC with the right knife-hand while forming a left walking stance toward BC.\n",
        "7": " Step 6. Execute a middle punch to BD with the left fist while forming a sitting stance toward BD. Perform 5 and 6 in a fast motion.\n",
        "8": " Step 7. Execute a high side block to BD with the left knife-hand while forming a right walking stance toward BD.\n",
        "9": " Step 8. Execute a middle punch to BD with the right fist while forming a sitting stance toward BD. Perform 7 and 8 in a fast motion.\n",
        "10": " Step 9. Move the right foot to C turning clockwise to form a parallel stance toward A while executing a horizontal strike with a twin knife-hand.\n",
        "11": " Step 10. Execute a high side piercing kick to C with the right foot keeping the position of the hands as they were in 9.\n",
        "12": " Step 11. Execute a high turning kick to D with the right foot. Perform 10 and 11 in a continuous kick.\n",
        "13": " Step 12. Lower the right foot to D in a jumping motion to form a right X-stance toward BD while executing a high side strike to D with the right back fist and bringing the left finger belly to the right side fist.\n",
        "14": " Step 13. Move the left foot to C forming a parallel stance toward B while executing a horizontal strike with a twin knife-hand.\n",
        "15": " Step 14. Execute a high side piercing kick to C with the left foot keeping the position of the hands as they were in 13.\n",
        "16": " Step 15. Execute a high turning kick to D with the left foot. Perform 14 and 15 in a continuous kick.\n",
        "17": " Step 16. Lower the left foot to D in a jumping motion to form a left X-stance toward AD while executing a high side strike to D with the left back fist and bringing the right finger belly to the left side fist.\n",
        "18": " Step 17. Move the left foot to A forming a right L-stance toward A executing a low punch to A with a left double fist.\n",
        "19": " Step 18. Bring the right palm on the left fore fist and then twist them counter clockwise until the left back fist faces downward while forming a left walking stance toward A, slipping the left foot. Perform in a releasing motion.\n",
        "20": " Step 19. Execute a high punch to A with the right fist while maintaining a left walking stance toward A.\n",
        "21": " Step 20. Move the left foot on line AB to form a left L-stance toward B while executing a low punch to B with a right double fist.\n",
        "22": " Step 21. Bring the left palm on the right fore fist and then twist them clockwise until the right back fist faces downward while forming a right walking stance toward B, slipping the right foot. Perform in a releasing motion.\n",
        "23": " Step 22. Execute a high punch to B with the left fist while maintaining a right walking stance toward B.\n",
        "24": " Step 23. Slide to B to form a right L-stance toward B while executing an upset punch to B with the right middle knuckle fist and bringing the left side fist in front of the right shoulder.\n",
        "25": " Step 24. Execute a front strike to B with the right back fist while forming a left walking stance toward B, slipping the right foot.\n",
        "26": " Step 25. Slide to A, turning clockwise to form a left L-stance toward A while executing an upset punch to A with the left middle knuckle fist and bringing the right side fist in front of the left shoulder.\n",
        "27": " Step 26. Execute a front strike to A with the left back fist while forming a right walking stance toward A, slipping the left foot.\n",
        "28": " Step 27. Move the left foot to D forming a right walking ready stance toward C.\n",
        "29": " Step 28. Jump to execute a flying front snap kick to C with the right foot.\n",
        "30": " Step 29. Land to C forming a left L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "31": " Step 30. Move the right foot to D to form a left walking stance toward C while executing a high front block with the right forearm.\n",
        "32": " Step 31. Execute a middle punch to C with the left fist while shifting to C, maintaining a left walking stance toward C.\n",
        "33": " Step 32. Turn clockwise, pivoting with the left foot to form a right walking stance toward D while executing a high front block with the left forearm.\n",
        "34": " Step 33. Execute a middle punch to D with the right fist while shifting to D, maintaining a right walking stance toward D.\n",
        "35": " Step 34. Execute a middle block to BC with a double arc-hand while forming a left walking stance toward BC and looking through the hands.\n",
        "36": " Step 35. Execute a high inward strike to BC with the right knife-hand and bringing the left side fist in front of the right shoulder while maintaining a left walking stance toward BC.\n",
        "37": " Step 36. Execute a circular block to BD with the left inner forearm while forming a right walking stance toward D.\n",
        "38": " Step 37. Execute a high punch to D with the right fist while maintaining a right walking stance toward D.\n",
        "39": " Step 38. Execute a low front snap kick to D with the left foot keeping the position of the hands as they were in 37.\n",
        "40": " Step 39. Lower the left foot to D forming a left walking stance toward D while executing amiddle punch to D with the left fist.\n",
        "41": " Step 40. Execute a middle punch to D with the right fist while maintaining a left walking stance toward D. Perform 39 and 40 in a fast motion.\n",
        "42": " Step 41. Execute a rising block with an X-knife-hand while maintaining a left walking stance toward D.\n",
        "43": " Step 42. Execute a middle block to AC with a double arc-hand while forming a right walking stance toward AC and looking through the hands.\n",
        "44": " Step 43. Execute a high inward strike to AC with the left knife-hand and bringing the right side fist in front of the left shoulder while maintaining a right walking stance toward AC.\n",
        "45": " Step 44. Execute a circular block to AD with the right inner forearm while forming a left walking stance toward D.\n",
        "46": " Step 45. Execute a high punch to D with the left fist while maintaining a left walking stance toward D.\n",
        "47": " Step 46. Execute a low front snap kick to D with the right foot keeping the position of the hands as they were in 45.\n",
        "48": " Step 47. Lower the right foot to D forming a right walking stance toward D while executing a middle punch to D with the right fist.\n",
        "49": " Step 48. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D. Perform 47 and 48 in a fast motion.\n",
        "50": " Step 49. Execute a rising block with an X-knife-hand while maintaining a right walking stance toward D.\n",
        "51": " Step 50. Move the left foot to D, and then slide to D, turning counter-clockwise to form a right L-stance toward C while executing a low guarding block to C with a knife-hand.\n",
        "52": " Step 51. Jump to C, spinning counter-clockwise to form a right L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "53": " Step 52. Execute a low block to D with the right knife-hand and a middle outward block to D with the left inner forearm while forming a left walking stance toward D, slipping the left foot.\n",
        "54": " Step 53. Execute a high punch to D with the right fist while maintaining a left walking stance toward D. Perform 52 and 53 in a continuous motion.\n",
        "55": " Step 54. Execute a middle punch to D with the left fist while forming a right L-stance toward D, pulling the left foot.\n",
        "56": " Step 55. Move the right foot to D, and then slide to D, turning clockwise to form a left L-stance toward C while executing a low guarding block to C with a knife-hand.\n",
        "57": " Step 56. Jump to C, spinning clockwise to form a left L-stance toward D while executing a middle guarding block to D with the forearm.\n",
        "58": " Step 57. Execute a low block to D with the left knife-hand and a middle outward block to D with the right inner forearm while forming a right walking stance toward D slipping the right foot.\n",
        "59": " Step 58. Execute a high punch to D with the left fist while maintaining a right walking stance toward D. Perform 57 and 58 in a continuous motion.\n",
        "60": " Step 59. Execute a middle punch to D with the right fist while forming a left L-stance toward D, pulling the right foot.\n",
        "61": " Step 60. Move the right foot to the side rear of the left foot, and then slide to C, forming a left L-stance toward D at the same time executing a scooping block with the right palm.\n",
        "62": " Step 61. Shift to D, maintaining a left L-stance toward D while executing a middle punch to D with the left fist.\n",
        "63": " Step 62. Turn clockwise while forming a left bending ready stance A toward C.\n",
        "64": " Step 63. Execute a high side piercing kick to C with the right foot, keeping the position of the hands as they were in 62.\n",
        "65": " Step 64. Lower the right foot to C, forming a right walking stance toward C while executing a middle punch to C with the left fist.\n",
        "66": " Step 65. Move the right foot to D, forming a right L-stance toward C while executing a middle guarding block to C with a knife-hand.\n",
        "67": " Step 66. Move the left foot to the side rear of the right foot, and then slide to D, forming a right L-stance toward C while executing a scooping block with the left palm.\n",
        "68": " Step 67. Shift to C, maintaining a right L-stance toward C while executing a middle punch to C with the right fist.\n",
        "69": " Step 68. Turn counter-clockwise while forming a right bending ready stance A toward C.\n",
        "70": " Step 69. Execute a high side piercing kick to D with the left foot, keeping the position of the hands as they were in 68.\n",
        "71": " Step 70. Lower the left foot to D to form a left walking stance toward D at the same time executing a middle punch to D with the right fist.\n",
        "72": " Step 71. Move the left foot to C to form a left L-stance toward D while executing a middle guarding block to D with a knife-hand.\n",
        "73": " Step 72. Execute a high punch to D with the right fist while forming a right walking stance toward D, slipping the right foot. Perform 71 and 72 in a continuous motion.\n",
        "74": " End: Bring the foot back to a ready position\n"
      },
      "title": " So-San "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 24\n",
        "1": " Ready Posture: Closed Ready Stance B\n",
        "2": " Step 1. Move the left foot to B, forming a left walking stance toward B at the same time executing a low block to B with the left forearm.\n",
        "3": " Step 2. Bring the left foot to the right foot, and then move the right foot to A to form a left L-stance toward A while executing a twin forearm block.\n",
        "4": " Step 3. Execute a middle side piercing kick to D with the right foot.\n",
        "5": " Step 4. Lower the right foot to D, and then move the left foot to F to form a left walking stance toward F while executing a rising block with the left forearm.\n",
        "6": " Step 5. Bring the left foot to the right foot, and then move the right foot to E to form a sitting stance toward D while executing a middle strike to E with the right knife-hand.\n",
        "7": " Step 6. Bring the right foot to the left foot, forming a closed ready stance B toward D.\n",
        "8": " Step 7. Jump to D to form a left X-stance toward DG while executing a high side strike to D with the left back fist, bringing the right finger belly to the left side fist.\n",
        "9": " Step 8. Move the right foot to G, forming a right walking stance toward G while executing a high punch to G with the right fist.\n",
        "10": " Step 9. Move the right foot on line GH to form a left fixed stance toward H while executing a high guarding block to H with the forearm.\n",
        "11": " Step 10. Move the right foot to H, forming a right walking stance toward H while executing a middle thrust to H with the right straight finger tip.\n",
        "12": " Step 11. Bring the right foot to the left foot, and then move the left foot to G to form a left walking stance toward G while executing a high side strike to G with the left back fist.\n",
        "13": " Step 12. Move the left foot on line GH to form a sitting stance toward C while executing a scooping block with the left palm.\n",
        "14": " Step 13. Execute a middle turning kick to C with the left foot.\n",
        "15": " Step 14. Lower the left foot to C in a jumping motion, forming a left X-stance toward CF while executing a high block to C with the left double forearm.\n",
        "16": " Step 15. Move the right foot to F to form a sitting stance toward C while extending the right fist horizontally to C. Perform in a slow motion.\n",
        "17": " Step 16. Execute a front strike to C with the left back fist while maintaining a sitting stance toward C.\n",
        "18": " Step 17. Bring the right foot behind the left foot, and then move the left foot to E, forming a left diagonal stance toward C while executing a pressing block with a twin palm.\n",
        "19": " Step 18. Execute a middle block to C with a double arc-hand while forming a left walking stance toward CE.\n",
        "20": " Step 19. Pull the left reverse footsword to the right knee joint to form a right one-leg stance toward C at the same time executing a high side block to F with the right outer forearm and a low side block to E with the left forearm.\n",
        "21": " Step 20. Lower the left foot to D forming a right walking stance toward C while executing a pressing block with the right palm. Perform in a slow motion.\n",
        "22": " Step 21. Pull the left instep to the hollow of the right leg to form a right one-leg stance toward C while striking the left palm with the right back forearm.\n",
        "23": " Step 22. Lower the left foot to C, turning clockwise to form a right fixed stance toward D while thrusting to C with the left side elbow.\n",
        "24": " Step 23. Move the right foot to A, forming a left L-stance toward A while executing a high guarding block to A with a knife-hand.\n",
        "25": " Step 24. Bring the right foot to the left foot, and then move the left foot to B to form a right L-stance toward B while executing a middle punch to B with the right fist.\n",
        "26": " End: Bring the foot back to a ready position\n"
      },
      "title": " Se-Jong "
    },
    {
      "patternSteps": {
        "0": " Number of Moves: 56\n",
        "1": " Ready Posture: Parallel Stance with an Overlapped Back Hand\n",
        "2": " Step 1. Move the right foot to C to form a left walking stance toward D while executing a middle punch to D with a twin fist. Perform in slow motion.\n",
        "3": " Step 2. Move the left foot to C to form a right walking stance toward D while executing a horizontal strike with a twin knife-hand. Perform in slow motion.\n",
        "4": " Step 3. Move the left foot to D, forming a right rear foot stance toward D while executing a middle inward block to D with the left outer forearm.\n",
        "5": " Step 4. Execute a low inward block to D with the right palm while forming a left walking stance toward D, slipping the right foot, and bringing the left side fist in front of the right shoulder.\n",
        "6": " Step 5. Move the right foot to D, forming a left L-stance toward D while executing a middle punch to D with the right fist.\n",
        "7": " Step 6. Execute a middle punch to D with the left fist while maintaining a left L-stance toward D. Perform 5 and 6 in a fast motion.\n",
        "8": " Step 7. Move the left foot to Din a stamping motion to form a right L-stance toward D while executing a high outward strike to D with the left back hand.\n",
        "9": " Step 8. Execute an inward vertical kick to the left palm with the right reverse footsword.\n",
        "10": " Step 9. Lower the right foot to D in a stamping motion, forming a left L-stance toward D while executing a high outward strike to D with the right back hand.\n",
        "11": " Step 10. Execute an inward vertical kick to the right palm with the left reverse footsword.\n",
        "12": " Step 11. Lower the left foot to D, and then execute a horizontal block with a twin palm while forming a right L-stance toward D, slipping the left foot. Perform in a slow motion.\n",
        "13": " Step 12. Move the right foot to D, forming a right walking stance toward D while executing a high side block to D with the right reverse knife-hand. Perform in a slow motion.\n",
        "14": " Step 13. Execute a middle side block to D with the left reverse knife-hand while maintaininga right walking stance toward D. Perform in a slow motion.\n",
        "15": " Step 14. Execute a middle punch to D with the right fist while maintaining a right walking stance toward D.\n",
        "16": " Step 15. Execute a middle punch to D with the left fist while maintaining a right walking stance toward D.\n",
        "17": " Step 16. Execute a downward kick to AC with the right foot, keeping the position of the hands as they were in 15.\n",
        "18": " Step 17. Lower the right foot to C in a stamping motion, forming a left L-stance toward C while executing a downward strike to C with the right back fist.\n",
        "19": " Step 18. Execute an outward vertical kick to BC with the left foot, keeping the position of the hands as they were in 17.\n",
        "20": " Step 19. Lower the left foot to C in a stamping motion to form a right L-stance toward C while executing a downward strike to C with the left back fist.\n",
        "21": " Step 20. Execute a high punch to D with the left fist while forming a right walking stance toward D, pivoting with the left foot.\n",
        "22": " Step 21. Execute a high punch to D with the right fist while maintaining a right walking stance toward D. Perform 20 and 21 in a fast motion.\n",
        "23": " Step 22. Move the left foot to D, forming a right rear foot stance toward D while executing an upward block with the left bow wrist.\n",
        "24": " Step 23. Move the right foot to D to form a left rear foot stance toward D while executing an upward block with the right bow wrist.\n",
        "25": " Step 24. Move the left foot to C, forming a left walking stance toward C while executing a pressing block with the left palm.\n",
        "26": " Step 25. Move the right foot to C to form a right walking stance toward C while executing a pressing block with the right palm. Perform 24 and 25 in a slow motion.\n",
        "27": " Step 26. Bring the left foot to the right foot to form a closed stance toward C while bringing both back hands in front of the lower abdomen in a circular motion, hitting the left palm with the right knife-hand.\n",
        "28": " Step 27. Move the left foot to D, forming a left walking stance toward D while executing a rising block with the left knife-hand.\n",
        "29": " Step 28. Execute a high punch to D with the right fist while maintaining a left walking stance toward D.\n",
        "30": " Step 29. Slide to D to form a left L-stance toward D while executing an upset punch to D with the left fist, bringing the right side fist in front of the left shoulder.\n",
        "31": " Step 30. Move the right foot to C, forming a left walking stance toward D while executing a high thrust with the right angle fingertip.\n",
        "32": " Step 31. Move the left foot on line CD to form a right walking stance toward C while executing a rising block with the right knife-hand.\n",
        "33": " Step 32. Execute a high punch to C with the left fist while maintaining a right walking stance toward C.\n",
        "34": " Step 33. Slide to C to form a right L-stance toward C while executing an upset punch to C with the right fist, bringing the left side fist in front of the right shoulder.\n",
        "35": " Step 34. Move the left foot to D, forming a right walking stance toward C while executing a high thrust with the left angle fingertip.\n",
        "36": " Step 35. Execute a low guarding block to C with a reverse knife-hand in a circular motion while forming a left L-stance toward C, pivoting with the left foot.\n",
        "37": " Step 36. Execute a low guarding block to D with a reverse knife-hand in a circular motion while forming a right L-stance toward D, pivoting with the right foot.\n",
        "38": " Step 37. Execute a low block to D with the right forearm and a middle outward block to D with the left knife-hand while forming a left walking stance toward D, slipping the left foot.\n",
        "39": " Step 38. Move the right foot to D in a stamping motion to form a right walking stance toward D at the same time executing a high vertical punch to D with a twin fist.\n",
        "40": " Step 39. Pull the right reverse footsword to the left knee joint, forming a left one-leg stance toward D while striking the left palm with the right back forearm.\n",
        "41": " Step 40. Execute a middle back piercing kick to C with the right foot, pulling both hands in the opposite direction.\n",
        "42": " Step 41. Lower the right foot to C to form a sitting stance toward A while executing a W-shape block with the outer forearm.\n",
        "43": " Step 42. Slide to C maintaining a sitting stance toward A while executing a W-shape block with the outer forearm.\n",
        "44": " Step 43. Move the right foot to D in a stamping motion, turning counter clockwise to form a sitting stance toward B while executing a W-shape block with the outer forearm.\n",
        "45": " Step 44. Slide to C, maintaining a sitting stance toward B while executing a W-shape block with the outer forearm.\n",
        "46": " Step 45. Pull the left reverse footsword to the right knee joint, forming a right one-leg stance toward C while striking the right palm with the left back forearm.\n",
        "47": " Step 46. Execute a high back piercing kick to D with the left foot, pulling both hands in the opposite direction.\n",
        "48": " Step 47. Lower the left foot to C in a jumping motion, forming a left X-stance toward C while executing a pressing block with an X-fist.\n",
        "49": " Step 48. Move the right foot to D, forming a left walking stance toward C while executing a front strike with the left under fist.\n",
        "50": " Step 49. Move the right foot to C to form a right walking stance toward C while executing a front strike with the right under fist.\n",
        "51": " Step 50. Execute a middle pushing block to C with the left palm while maintaining a right walking stance toward C.\n",
        "52": " Step 51. Execute a circular block to A with the right knife-hand while forming a left walking stance toward AD.\n",
        "53": " Step 52. Move the left foot to C to form a left walking stance toward C while executing a middle pushing block to C with the right palm.\n",
        "54": " Step 53. Execute a circular block to B with the left knife-hand while forming a right walking stance toward BD.\n",
        "55": " Step 54. Execute a high side piercing kick to D with the right foot, forming a forearm guarding block, and then lower it to the left foot to form a closed stance toward D while executing a twin side back elbow thrust.\n",
        "56": " Step 55. Move the left foot to D, forming a sitting stance toward A while executing a middle side punch to D with the left fist.\n",
        "57": " Step 56. Execute a middle punch to D with the right fist while forming a left walking stance toward D, pivoting with the left foot.\n",
        "58": " End: Bring the foot back to a ready position\n"
      },
      "title": " Tong-Il "
    }
  ]
}